[
 {"id":"24fR33JG4f","rules":"Normal sudoku rules apply. Digits along thermometers must increase from the bulb. Digits joined by a white dot must be consecutive; those joined by a black dot must have a 1:2 ratioDigits along arrows sum to the number in the connected circle. Identical digits cannot be either a knight's move or a king's move apart."}
,{"id":"2786N2rgLR","rules":"Normal sudoku rules apply.  A cell with a grey circle must contain an odd digit.  A cell with a grey square must contain an even digit.  Along thermometers, digits must increase from the bulb end."}
,{"id":"2Bd4DGrQm2","rules":"Normal sudoku rules apply. Digits cannot repeat on either of the main diagonals (marked in blue).  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage."}
,{"id":"2Lp4R6L272","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Adjacent digits on an orange line have a difference of at least 5."}
,{"id":"2MtptTjj64","rules":"Normal sudoku rules apply. Exactly two of the 3x3 boxes are identical clones."}
,{"id":"2PNQJ3823q","rules":"Normal sudoku rules apply, two adjacent cells can't have consecutive values, two cells separated by a knight's move can't have the same value. Radars are cells that have a value indicating the distance to the closest 9 on their row or column. All radars are marked grey and every marked cell is a radar."}
,{"id":"2PqTbt7MhQ","rules":"Normal sudoku rules apply. Digits along an arrow sum to the digit in that arrow's circle. Purple lines must contain a string of consecutive digits, in any order."}
,{"id":"2QNMDD7mjr","rules":"Normal sudoku rules apply. Apart from the central even cell, the grid must be filled with one or more pentominoes of each listed type, in which the top-left cell of the shape contains the given digit: 1=I, 2=W, 3=T, 4=L, 5=V, 6=X, 7=N, 8=Y, 9=P. Digits do not repeat in pentominoes, and two of the same type may not touch each other orthogonally. Cells joined by symbols are consecutive (white dot), have a ratio of 1:2 (black dot), or sum to five (V). Not all symbols are given."}
,{"id":"2ftJ4jLbDG","rules":"Normal sudoku rules apply. Cells separated by a knight's or king's move in chess cannot contain the same digit. Digits in the Nth column indicate in which column the digit N is placed in the respective row. Eg if R3C2 is a 5, the fifth column in the third row (R3C5) must contain a 2. "}
,{"id":"2g7LQNtf2j","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Cells containing a grey square must contain an even digit."}
,{"id":"2gmhjNF7PF","rules":"Normal sudoku rules apply. Digits along arrows sum to the digit in the attached circle. Clues outside the grid show the sum of the indicated diagonal."}
,{"id":"33MN2jT4Hf","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. In cages, digits must sum to the small clue in the top left corner of the cage (if given). Along each main diagonal (marked in blue) digits cannot repeat.  "}
,{"id":"33Mj28bTQP","rules":"Normal sudoku rules apply. Digits on arrows sum to the number in the circle. Grey (renban) lines feature four consecutive digits in any order."}
,{"id":"366Pj32HbT","rules":"Normal sudoku rules apply. White dots join cells with consecutive digits; black dots join cells with a 1:2 ratio. Not all dots are given."}
,{"id":"36gndhn8ND","rules":"Normal sudoku rules apply. Digits in a cage cannot repeat, and sum to the small number in the top left corner of the cage, but is written in binary, octal or hexadecimal (base 2, 8 or 16)."}
,{"id":"38mj2npj2d","rules":"Normal sudoku rules apply. Cages show their sums."}
,{"id":"3F37hMHfLR","rules":"Normal sudoku rules apply. 9 pairs of 'Poles' are marked with circles on the grid. Both cells of a pair have the same 'height' value and that value does not repeat along the line connecting them. Each pair has a unique height (eg the Poles of value 4 are already given, therefore, the line connecting the fours cannot contain a third 4 and no other circled cell can contain a 4)."}
,{"id":"3GD4Fp9RGr","rules":"Normal sudoku rules apply.  Cells separated by a white dot must contain consecutive digits.  Cells separated by a black dot must contain digits in the ratio 1:2. Not all dots are given.  The red line is a palindrome for which the start cell and end cell must be determined.  The line must read the same in either direction.  Neighbouring digits along the line cannot be further apart in value than two steps (so a 5 would have to be next to 3,4,5,6 or 7).  For this purpose 1 and 9 are considered to be consecutive. (E.g., a 1 can have the digits 8, 9, 1, 2 or 3 as neighbors along the line.) "}
,{"id":"3Gmmrtr4hp","rules":"Normal sudoku rules apply. Grey lines are palindromes, reading the same in each direction. Black dots join cells with a ratio of 1:2; white dots join cells with consecutive digits. Not all dots are given. The inequality sign 'points' at the lower digit."}
,{"id":"3GtDr9bTRb","rules":"Normal sudoku rules apply.  Along thermometers, digits must increase from the bulb end."}
,{"id":"3HG8mfT49q","rules":"Normal Sudoku rules apply.  Cells that have an X between them add to 10, and cells that have a V between them add to 5. Not all Xs and Vs are marked. A grey line of length n contains n sequential (consecutive) digits, but they may be arranged in any order on the line."}
,{"id":"3HbhqRrQRR","rules":"Normal sudoku rules apply.  Digits along an arrow sum to the digit in that arrow's circle."}
,{"id":"3JqbBfpJHp","rules":"Normal sudoku rules apply. Digits along thermometers must increase from the bulb. Diagonally adjacent digits joined by a white dot must be consecutive; those joined by a black dot must have a 1:2 ratio (1 and 2 might be joined by a white or black dot). No other diagonally adjacent digits in the grid can be consecutive or have a 1:2 ratio."}
,{"id":"3MdQph698j","rules":"Normal sudoku rules apply. Digits along an arrow in the grid sum to the digit in that arrow's circle. Clues outside the grid give the sum of the digits along the indicated diagonal. Digits can repeat along such diagonals if allowed by other rules."}
,{"id":"3P3mjRD2RQ","rules":"Normal sudoku rules apply. Cages show their sums. Circles mark odd digits; squares mark even digits. Lines are palindromes, which read the same either way."}
,{"id":"3PNDfGd4d3","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage. Digits on a purple line must be between the values placed in the circled ends of that line.   "}
,{"id":"3Rf6DHNPhb","rules":"Normal sudoku rules apply. Grid markings are either arrows or thermos. Thermos ascend from the bulb, and arrows sum to the number in the bulb."}
,{"id":"3Tbt4Ftqnj","rules":"Normal sudoku rules CANNOT apply: no digit can appear exactly once in any row, box, or column. There are exactly nine of each digit. Digits cannot appear exactly once within a cage and cannot sum to the value indicated. Digits along a thermometer strictly do not increase from the bulb end: they may decrease or stay the same, but never increase. Numbers with a black dot between them cannot have a ratio of 2."}
,{"id":"3b6NHjDNMr","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage.  On each main diagonal (marked in blue) digits cannot repeat."}
,{"id":"3bJgQPpDdj","rules":"Divide the grid into nine orthogonally-connected regions, each containing nine cells.  Each row, column and region must contain the digits 1 to 9, once each.  A clue outside the grid indicates that the first X cells in the row/column from that direction are in the same region, with X being the digit in the first cell.  Moreover, the next cell (the (X+1)th cell) is part of a different region. The clue further indicates the sum of the digits in those X cells. In some cases, the clue has been replaced by a question mark, which stands for any single- or double-digit number. "}
,{"id":"3dr6pFrqpP","rules":"Normal sudoku rules apply.  Cells separated by a V contain digits summing to 5.  Cells separated by an X contain digits summing to 10.  All possible Vs and Xs are given."}
,{"id":"3f6bGR3Mr4","rules":"Normal sudoku rules apply. Each coloured area contains no repeated digits. Digits must not repeat on the main diagonals.  Digits in a cage must sum to the number given. Digits joined with a black dot have a 2:1 ratio. Not all dots are given. "}
,{"id":"3gqfH234Nr","rules":"Normal sudoku rules apply. And that's it!"}
,{"id":"3m7Q92r3qF","rules":"Normal sudoku rules apply. Digits along an arrow add up to the number in a circle - in no case does any cell on an arrow share a row, column or 3x3 box with its circle. The X in r1c8 is a 1-cell arrow."}
,{"id":"3mg6PRM6bF","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. The clue outside the grid gives the sum of the digits along the indicated diagonal.  Digits can repeat along this diagonal if allowed by other rules."}
,{"id":"3mpGprnBPF","rules":"Normal sudoku rules apply. Digits increase along thermometers, from the bulb."}
,{"id":"3nJD2rJtn3","rules":"Normal sudoku rules apply. In each cage, digits cannot repeat and sum to the value in the top left corner. In each row and column i, the digits of 9*i will appear in order. For example, in row and column 5, 5*9=45 and so the digit 4 appears before 5."}
,{"id":"3pj77G2R69","rules":"Normal sudoku rules apply. The digits in each cage and along each diagonal indicated by an arrow outside the grid must sum to a perfect square. Digits may not repeat within cages, but may repeat along the indicated diagonals if allowed by other rules."}
,{"id":"3qG93JFb6M","rules":"Normal sudoku rules apply. Circles show digits that must each appear in at least one touching cell. Lines are occupied by a sequence of consecutive digits, in any order."}
,{"id":"3rndTLBfqr","rules":"Normal sudoku rules apply. Identical digits cannot be a knight's move apart. Digits cannot repeat in cages, which show their sums. Any two cells joined by a line must have a difference of at least 5."}
,{"id":"48m3j7PRtj","rules":"Normal sudoku rules apply. Digits along an arrow sum to the digit in that arrow's circle.  Cells separated by a knight's move (in chess) cannot contain the same digit."}
,{"id":"49MnD2jLrB","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. The digits on a line must increase from one end to the other."}
,{"id":"4BnH49pdNJ","rules":"1-9 appear in each row, column and marked region. Identical digits cannot appear within a king's or knight's move of each other. Consecutive numbers cannot appear in (orthogonally) neighbouring cells. The cage shows its total."}
,{"id":"4DMg6BDj7q","rules":"Normal sudoku rules apply. Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits along such a diagonal may repeat if allowed by other rules.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"4FN8RN9LfN","rules":"Normal Sudoku rules apply.\\nIn addition, a loop needs to be drawn into the grid, obeying the rules of Masyu, when all 1's are considered as white pearls and all 2's are considered as black pearls. Clues outside the grid indicate the sum of digits in loop cells in the respective row or column."}
,{"id":"4FgQQhPTn4","rules":"Normal sudoku rules apply. Digits cannot repeat in cages, which show their sums. White dots join cells with consecutive digits; black dots join cells with a 1:2 ratio. Not all dots are given. "}
,{"id":"4GP3nrFJLd","rules":"Normal sudoku rules apply. Grey circles contain odd digits. Digits in the grid represent the height of skyscrapers.  Clues outside the grid indicate the number of visible skyscrapers in that row/column as seen from that vantage point. Draw Godzilla's path through the grid, which starts and ends in the grey cells.  Godzilla moves orthogonally between cells and his path cannot touch itself orthogonally or diagonally.  Cells on Godzilla's path do not count towards the skyscraper clues (Godzilla destroys the skyscrapers). Godzilla cannot go through cells containing the digit 9. (He is not powerful enough to destroy the tallest skyscrapers)."}
,{"id":"4JmGBRNDBN","rules":"Normal sudoku rules apply. Digits along each arrow must sum to the digit in that arrow's circled cell. Cells along lines between two filled circles must have values between those in the circles."}
,{"id":"4JnMFpQJ3n","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"4N3ThH99qg","rules":"Normal sudoku rules apply to the first 9 rows ie the 9x9 grid - but not the 10th row. The 10th row consists of all digits 1 to 9 once each and does not affect the 9x9 grid by sudoku; rather, a digit in this row indicates that the same digit is found in the equivalently valued row of that particular column. eg the digit 4 placed in row 10 means that 4 is found in the 4th row of that same column. Cages (which include the large red cage) must sum to either 3, 4, 33, 43 or 433; cages within the 9x9 grid may not contain repeated digits. Cells separated by a white dot contain consecutive digits; not all dots are given."}
,{"id":"4RjT2dp9HN","rules":"Normal sudoku rules apply. Digits in circles must appear in the surrounding cells. Digits along diagonals must not repeat. A black dot joins digits with a 2:1 ratio. Not all dots are shown."}
,{"id":"4bPt8LRpRb","rules":"Normal sudoku rules apply. The clues outside the grid indicate the sum of the first X digits placed in the corresponding row/column, where X is equal to the first digit in that row/column. In these clues, even digits have been replaced by E. (Zero is even. Multi-digit clues may not start with zero.)"}
,{"id":"4dgGmtf6RQ","rules":"Place a number from 1-7 into each empty cell so that each row, column and outlined 8-cell region contains each number at least once."}
,{"id":"4jmjMjfqM2","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Each grey line contains a set of consecutive, non-repeating digits in any order."}
,{"id":"4mDGb8QdDP","rules":"Normal sudoku rules apply. Digits along arrows sum to the number in the circle (or 2-digit number in the 'pill'). X joins two cells that sum to 10 (not all X's are given). Digits in cages do not repeat, and their sum may be shown. Clues outside the grid show the sum of the indicated diagonal. The blue and red cell in r1 are consecutive digits."}
,{"id":"4ndLTTHRpf","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the attached circle - 2-digit numbers in pills are read left-to-right or downwards."}
,{"id":"4pqQHjg6rG","rules":"Normal sudoku rules apply. Digits separated by a knight's move (in chess) cannot contain the same digit. In cages, digits must sum to the small clue in the top left corner of the cage. The inequality sign points to the lower digit. The green lines are 'palindrometers'. Digits along a palindrometer must increase from the bulb.  Digits along a palindrometer must also read the same forwards and backwards (like a palindrome) with the bulb acting as the centre of the palindrome."}
,{"id":"4r2BpLTLNG","rules":"Normal Sudoku rules apply. The cells passed through by each wheel must contain the indicated values in the given order, but the wheels might have to be rotated in the correct position."}
,{"id":"4rPjgJNdF2","rules":"Normal sudoku rules apply. Identical digits cannot be a knight's move apart. Consecutive digits cannot be (orthogonal) neighbours. A number in a white circle must appear at least once in the four surrounding cells. A number outside the grid appears in the first four cells of that row/column from that direction."}
,{"id":"4rjdBRPmdF","rules":"Normal sudoku rules apply. A value outside the grid gives the sum of the first X digits in that direction, where X is the first digit in that row or column. "}
,{"id":"68NtD2Q6B7","rules":"The grid consists of two overlapping 6x6 sudokus, each containing 1-6 in each row, column and 2x3 box. The digits along an arrow sum to the number in the attached circle."}
,{"id":"68mFFbLRMn","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb. Cages show their sums. Clues outside the grid show the total of digits sandwiched in that row/column between the 1 and the 9."}
,{"id":"6B6T8TLbFH","rules":"Normal sudoku rules appy. Identical cells cannot be a knight's move apart. Identical cells cannot appear within the same position in two 3x3 boxes. Grey lines are palindromes. A clue outside the grid shows the sum of the indicated diagonal, which may include repeats."}
,{"id":"6BQ7BjmQBg","rules":"Normal sudoku rules apply, and each coloured region contains the digits 1-9. Along thermometers, digits increase from the bulb."}
,{"id":"6D4r2QfF7N","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits cannot repeat within a cage."}
,{"id":"6FTpFmNNhp","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits along an arrow must sum to the digit in that arrow's circle. Cells connected by a white dot contain consecutive digits. Cells connected by a black dot contain digits in a 1:2 ratio. Not all possible dots are given. "}
,{"id":"6HqJL2Mpjd","rules":"Normal sudoku rules apply. Digits may not repeat along lines. Clues outside the grid give the sum of the digits in that row or column which are on lines."}
,{"id":"6JBh99JDJJ","rules":"The grid must be divided into regions, each containing 9 cells.  Each row, column and region must contain the digits 1 to 9 once each. A number outside the grid gives the sum of the first M cells of the row/column from that direction.  M is the number of region borders in that row/column. The 4 cells surrounding a circle must belong to the same region. The 4 cells surrounding a black square belong to exactly three different regions. All unmarked 2x2 areas belong to two or four regions."}
,{"id":"6NMrnGH9n7","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage. Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat along such diagonals if allowed by other rules."}
,{"id":"6PB3MLGpFN","rules":"Normal sudoku rules apply. Along themometers digits must increase from the bulb end. Digits along an arrow sum to the digit in that arrow's circle. Digits in cells connected by a white dot are consecutive.  Digits in cells connected by a black dot have a ratio of 1:2. Each coloured line must contain the digits 1 to 9 once each, in any order."}
,{"id":"6PTDqHDB3R","rules":"Normal sudoku rules apply. Within cages, digits must increase from top to bottom along columns and increase along rows from left to right.  Digits cannot repeat within a cage."}
,{"id":"6PtJf32R7L","rules":"Normal sudoku rules apply. Each cage forms a 1-width long line.  The sum of all centre cells along such a line is double the sum of the two cells at the ends of a line.  Eg 1 2345 6 is a legal cage since 2*(1+6) = 2+3+4+5.  Digits cannot repeat within a cage.  "}
,{"id":"6Qq6GD2H2h","rules":"Normal sudoku rules apply."}
,{"id":"6b4fM2jNL4","rules":"Normal sudoku rules apply. All friendly cells in the grid form a single one-cell-wide orthogonally-connected snake, which cannot touch itself, even diagonally (a cell is 'friendly' if it has a value identical to its row-, column- or box-number).  Cells connected by a dot are both friendly; if they are the same 'type' of friendly (that is, both match the row-number, both match the column-number, or both match the box-number) the dot is white, and otherwise the dot is grey."}
,{"id":"6bnHjq8P2b","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits may not repeat within a cage. Digits along an arrow must sum to the digit given in that arrow's circle. Digits may repeat along an arrow if permitted by other rules."}
,{"id":"6dBPGMMf8r","rules":"Place a digit from 1-9 in each cell such that digits within an 'entry' (an unobstructed horizontal or vertical line of cells) do not repeat, and add up to the clued value (if provided)."}
,{"id":"6fGBF3dt8D","rules":"Normal sudoku rules apply, and each digit must occupy each possible position in a 3x3 box. Cages show their sums, and X joins two cells that sum to 10. Not all possible X's are given."}
,{"id":"6nb6Ndf63L","rules":"A lovably eccentric king has put before you a test. Choose one of three doors and encounter either: a lady (represented by the digit 1) who is the life and soul of a party or a tiger (represented by the digit 9) struggling with intermittent fasting. Behind two doors (in the cage) is a tiger (9) and no lady (1). Behind one door (in the cage) is a lady (1) and no tiger (9).  Signs hang above each door: Above Room 1: A tiger is in room 2. Above Room 2: A tiger is in this room. Above Room 3: A tiger is in room 1. The king tells you: The sign on the room with the lady is TRUE and at least one of the other signs is FALSE.  Answer the riddle, solve the sudoku, don't get eaten.  Normal sudoku rules apply.  In cages, digits sum to the small clue in the top left corner of the cage. Digits along an arrow sum to the digit in that arrow's circle. Cells with a grey circle must contain an odd digit. Cells separated by a white dot must contain consecutive digits.  Cells separated by a black dot contain digits with a ratio of 1:2.  Not all dots are given."}
,{"id":"6nhndtjdHB","rules":"Normal sudoku rules apply. The square bulb and line form a 'thermometer' which must be populated by double-digit numbers.  Each number starts with the tens-digit followed by the units digit (seen from the bulb end) ie tens and units digits alternate along the line.  The numbers must increase moving away from the bulb."}
,{"id":"6ntFBrGr9t","rules":"Normal sudoku rules apply.  Digits along arrows must sum to the digit in that arrow's circle."}
,{"id":"6pQgD6jgJn","rules":"Normal sudoku rules apply. Digits along the green line alternate between odd and even numbers. Digits along an arrow must sum to the digit in the connecting circle. Digits connected by a white dot must be consecutive. The digit in the larger circle must be in at least one of the four connecting cells. The gray square is an even digit."}
,{"id":"743Jt9n2BJ","rules":"Normal sudoku rules apply. Circled clues must belong to a killer cage that is rectangular in shape and sums to the total in the circle (if given) without containing a repeated digit. There must be exactly one circle per cage and the entire grid must be filled by these cages. Cages cannot overlap. "}
,{"id":"783gJP776Q","rules":"Normal sudoku rules apply."}
,{"id":"7BgqG63BR9","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of  the cage. Digits on grey lines form palindromes ie they must read the same forwards and backwards.  eg 13731."}
,{"id":"7BtmQgjnd6","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"7D4tNqhF9L","rules":"Normal Sudoku rules apply.  Cells separated by an X sum to 10.  Cells separated by a V sum to 5.  All XV clues are given.  Digits along thermometers must increase from the bulb end."}
,{"id":"7DJ9JQPqG2","rules":"Normal sudoku rules apply. Cells along arrows must sum to the digit in the attached circle. Clues outside the grid indicate the sum of digits 'sandwiched' between the 1 and 9 in that row or column."}
,{"id":"7NLb3Mj896","rules":"Normal sudoku rules apply. Digits along arrows sum to the number in the circle (which has been rounded to the nearest 5). Digits cannot repeat in cages, which sum to the given total (which has been rounded to the nearest 5). The black dot joins two digits with a 1:2 ratio."}
,{"id":"7NdjLLJ379","rules":"Normal sudoku rules apply. Grey circles represent odd digits. Digits along thermometers ascend or repeat from the bulb (slow thermo rules). The black and yellow lines are seven segments long."}
,{"id":"7P6D4JMt6n","rules":"Normal sudoku rules apply. Normal killer sudoku rules apply. (ie In cages, digits must sum to the clue given in the top left corner of the cage. Digits may not repeat within a cage.)"}
,{"id":"7RHt879R4r","rules":"Normal sudoku rules apply. Assuming the digits in the grid represent skyscrapers of that height. Clues outside the grid show the number of skyscrapers that can be seen in that row/column from that vantage point. Different letters represent different numbers, consistently throughout the puzzle."}
,{"id":"7T4HppdMRT","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"7b8G6LDQGH","rules":"Normal sudoku rules apply. Digits along thermometers must increase from the bulb."}
,{"id":"7dBBqHR3MP","rules":"Normal sudoku rules apply. Orthogonally adjacent cells cannot contain consecutive digits."}
,{"id":"7fgN2Pmp3h","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage. Cells containing an opaque grey circle must contain an odd digit; cells containing an opaque grey square must contain an even digit.  Along thermometers digits must increase from the bulb end.  A white dot separates cells containing consecutive digits.  A black dot separates cells containing digits in the ratio of 1:2.  Not all possible dots are given."}
,{"id":"7gJb9G8fRt","rules":"Normal sudoku rules apply."}
,{"id":"7gbg37R9fj","rules":"Normal sudoku rules apply.  Digits on a grey line must be between the digits on that line's circled ends.  Digits on a purple line must be consecutive (in any order).  Adjacent digits on a green line must have a difference of 5 or more.  Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits can repeat along such a diagonal if allowed by other rules."}
,{"id":"7hhdhdft3r","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage.  No swimming!"}
,{"id":"7jmr2DmnPh","rules":"Normal sudoku rules apply. Along thermometers, digits must increase from the bulb end."}
,{"id":"7qBGHmGJrj","rules":"Normal sudoku rules apply. Clues outside the grid show the total of the first X digits from that direction, where X is the first digit seen."}
,{"id":"7tF7DBtJn2","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Each purple line must contain a non-repeating set of consecutive digits (in any order)."}
,{"id":"7tPnB8m9m3","rules":"Divide the grid into pentominos (orthogonally connected 5-cell regions). Cells on either side of a given border must belong to different pentominos. Two pentominos of the same shape (including rotations and reflections) cannot share an edge."}
,{"id":"862N79FrfR","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"86gH3brJJq","rules":"Normal sudoku rules apply. Red cells in columns 1, 5 and 9 index (ie give) the column in which the digits 1,5 and 9 respectively appear in their respective row. All possible red cells in columns 1,5 and 9 are given. The digits on each purple line must be a consecutive set of digits (which can be in any order). Adjacent digits on a green line must differ by at least 5."}
,{"id":"87b3n8FJFN","rules":"Normal Sudoku rules apply. Battlefield rules apply: Consider the first X cells and the last Y cells of a row or column where X is the number in the first cell and Y is the number in the last cell. A clue outside the grid gives the sum of the digits where these groups overlap, or the sum of the digits in the gap between the groups if they don't overlap."}
,{"id":"8BqPnNG2nf","rules":"Normal sudoku rules apply. Cages cannot contain repeat digits, and show their sums. Grey circles show odd digits, grey squares show even digits."}
,{"id":"8DQ8dmt3bg","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Cells separated by a black dot must contain digits with a ratio of 1:2.  Cells separated by a white dot must contain digits that are consecutive. Each main diagonal (marked in blue) cannot contain a repeated digit."}
,{"id":"8DfMHmLpqP","rules":"Place the digits 1 to 9 once each into each row, column and region.  Regions need to be deduced by the solver and consist of 9 orthogonally-connected cells. For each blue line, digits on the line have an equal sum N within each region the line passes through. If a line passes through the same region more than once, each individual segment of such a line within that region sums to N separately. Every line must enter at least two regions. A digit in a circle indicates the number of digits on that particular segment of the line within that region. Not all circles are necessarily given."}
,{"id":"8DgD33JtBt","rules":"Normal sudoku rules apply. Numbers along the green line must alternate between odd and even digits. The black dots connect cells with a 2:1 ratio. The white dots connect cells with a difference of one. Not all black and white dots are shown."}
,{"id":"8GMb8g7fjj","rules":"Normal sudoku rules apply. Cells with opaque grey circles must contain odd digits.  Cells with opaque grey squares must contain even digits. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"8HqNFgLQD4","rules":"Normal sudoku rules apply."}
,{"id":"8NPmPfpN84","rules":"Normal sudoku rules apply.  Along thermometers, digits increase from the bulb end.  Digits in column 1 indicate the column in which the digit 1 appears in that row.  (eg if r4c1 is a 6, r4c6 is a 1).  The applies to columns 5 and 9 with the digits 5 and 9 respectively.  "}
,{"id":"8P6Qq6QRpj","rules":"Every row/column contains the digits 1-9 exactly once each. Digits may not repeat along the marked (blue) diagonal. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Every cage must be entirely shaded or unshaded, and every row and column contains at least one shaded cell.  In each row and column the cell that contains the number of shaded cells in that row/column is indicated either by a square or a circle.  Circles indicate that all shaded cells in that row/column are orthogonally connected; squares indicate those shaded cells are not all orthogonally connected (though some may be).  Whether a particular square/circle corresponds to its row/column (or both) is to be determined."}
,{"id":"8QpQhjJJ2H","rules":"Normal sudoku rules apply. Each main diagonal (marked in blue) cannot contain a repeated digit. Along thermometers, digits increase from the bulb end."}
,{"id":"8Rbb27h2pb","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Digits along a purple line cannot repeat and form a consecutive set in any order. "}
,{"id":"8RprrG92pb","rules":"Normal sudoku rules apply. A digit that is entered in a caged cell counts the number of instances of the digit in the top-left corner that appear in the cell, its row, its column and its diagonal neighbours."}
,{"id":"8fJHgNJqmM","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the circle. Clues outside the grid show the sum of the indicated diagonal, which can include repeats."}
,{"id":"8ghL89BqQg","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb end. The white cells must be tiled with one copy each of the twelve possible pentominoes.  If a pentomino contains a cell with a small clue in its top left corner, its cells sum to that number.  Digits in a pentomino may repeat if otherwise allowed."}
,{"id":"8hJDqhbFRQ","rules":"Normal sudoku rules apply. Digits do not repeat in cages. The sum of digits in a cage is given with the first digit as its precision (eg a cage 'sum' of 30 means the actual sum is somewhere between 30-3 (27) and 30+3 (33)."}
,{"id":"8jGgTPfJgd","rules":"Normal sudoku rules apply. Identical digits cannot be diagonally adjacent."}
,{"id":"8jPnpjrnr6","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage. The solver must run along an orthogonally connected path that starts and ends in the green cells. While on a green light, the solver must run as fast as they can and while on a red light they must try not to move. Speed is represented by the value of the digits! The solver is on a green light as long as the path goes on cells that aren't part of a killer cage. On these green cells the solver must keep up speed thus these cells must all contain high digits (6 or higher).  If the path crosses a killer cage, the solver has got a red light.  Here the solver must stay as still as they can in order not to be killed thus the red cells must contain low digits (4 or lower).  The path does not touch itself orthogonally or diagonally."}
,{"id":"8mbQn8HFH9","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb."}
,{"id":"8njQg7GTd7","rules":"Normal sudoku rules apply. Adjacent cells on green lines must differ by at least 5."}
,{"id":"8pJ8D987Tg","rules":"Normal sudoku rules apply. A black dot joins two cells with a ratio of 1:2. Not all dots are given. For the 'kropki digits' (1,2,3,4,6,8), identical digits cannot share a diagonal. ALong thermometers, digits increase from the bulb."}
,{"id":"8pmRJPFRbq","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"8qgqrTGT9D","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage. Grey lines are palindromes and must read the same forwards and backwards.  Digits cannot repeat on either main diagonal (marked in blue).  Cells separated by an X must contain digits summing to 10.  Not all Xs are given."}
,{"id":"8r6FPhhLbd","rules":"Normal sudoku rules apply. A clue outside the grid shows the sum of the digits along the indicated diagonal. Grey circles are odd numbers. The grey line is a palindrome, reading the same from both directions."}
,{"id":"92DBfq9dL9","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle.  Cells containing a grey square must contain an even digit.  Cells containing an (opaque) grey circle must contain an odd digit.  Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat along such a diagonal (if allowed by other rules).  White dots separate cells containing consecutive digits.  Not all white dots are given."}
,{"id":"92rNt22mHj","rules":"Normal sudoku rules apply.  Along thermometers, digits must increase from the bulb end.  Cells separated by a knight's move (in chess) cannot contain the same digit."}
,{"id":"947h9hGH7M","rules":"Normal sudoku rules apply. In cages, digits sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Digits along arrows sum to the digit in that arrow's circle.  Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat along such a diagonal if allowed by other rules."}
,{"id":"94Qq6qGjh2","rules":"Normal sudoku rules apply."}
,{"id":"98Q7RJ6Q8g","rules":"Normal sudoku rules apply. Digits cannot repeat in cages, which show their sums. Digits along an arrow sum to the number in the circle."}
,{"id":"99TDP9D7B2","rules":"Normal sudoku rules apply. Numbered arrows outside the grid indicate the sum of the digits along that diagonal path (which could repeat). The gray square is an even number. Adjacent digits along the lines alternate between odd and even numbers. Cells separated by a black dot are in the ratio 1 to 2. Cells separated by a white dot are consecutive. Not all possible dots are given."}
,{"id":"9F9jMN8ntn","rules":"Normal sudoku rules apply. Digits do not repeat in cages, which show their sum. Each digit appears in every possible position within a 3x3 box. The inequality sign 'points to' the lower digit."}
,{"id":"9FGBfdpL69","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Odd digits (1,3,5,7,9) can appear consecutively for more than two cells vertically but not more than two cells horizontally. Even digits (2,4,6,8) can appear consecutively for more than two cells horizontally but not more than two cells vertically."}
,{"id":"9GB9bhd2hF","rules":"Normal sudoku rules apply.  Along thermometers, digits must increase from the bulb end."}
,{"id":"9L9h4P4BFP","rules":"Normal sudoku rules apply. Clues outside the grid show how many buildings can be seen in that row/column, assuming that numbers in the grid represent buildings of that height. Sandwich clues are not given, but would show the sums of digits between 1 and 9, and would increase by 1 in every row going down the grid."}
,{"id":"9MQmRjRnTp","rules":"Normal sudoku rules apply. The cage shows its sum. Digits next to each other on a line have a difference of at least 5."}
,{"id":"9NBn32M3gb","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Digits cannot repeat along either of the main diagonals (marked in blue)."}
,{"id":"9QH4FQfDTb","rules":"Normal sudoku rules apply. Digits may not repeat in cages, and cages show their totals."}
,{"id":"9TMjF3FbRH","rules":"Normal sudoku rules apply. Digits in cages sum to the small clue in the top left corner of the cage. Digits along arrows sum to the digit in that arrow's circle. In large circles (without arrows) the indicated digit must appear in one of the surrounding cells. Cells separated by a small white dot must contain consecutive digits. "}
,{"id":"9hmL774prj","rules":"Normal sudoku rules apply.  Digits along an arrow sum to the digit in that arrow's circle.  Additionally, the digit in an arrow's circle will repeat in a cell pointed at by that circle's arrow tip.  This repeat can be one or more cells away from the arrow tip (but not the arrow tip cell itself)."}
,{"id":"9jJDgBpLjN","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Cells containing circles are the upper-left cell in a region of size x by x, where x is the digit in the circle.  Digits CAN repeat within a region.  The digits in each region must sum to the same total but the digits in the circles can be different."}
,{"id":"9jtdPrNnq4","rules":"Each row, column and region contains 1-9. Digits do not repeat in cages, which show their sum. Clues outside the grid show the sum of the indicated diagonal, which may contain repeats. Regions are to be completed, but a black line in the grid always separates different regions."}
,{"id":"9mBDpM486d","rules":"Normal sudoku rules apply. Digits along the marked diagonal must not repeat. Cells separated by a white dot have a difference of 1. Cells separated by a black dot have a 1:2 ratio. Not all dots are given. Grey squares are even numbers."}
,{"id":"9pHpmQqr79","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Along thermometers, digits must increase from the bulb end.  Grey lines (without circles) are palindromes ie the digits in both tips are equal."}
,{"id":"9pnq68nq6m","rules":"Enter a single digit from 1 to 9 into each white cell so that the sum of digits in each Across entry equals the value in grey to the left of the entry (if given), and the sum of digits in each Down entry equals the value in grey above the entry (if given). No digit may be repeated within a single entry.  A white circle between two cells shows that the digits in those cells are consecutive (i.e., they differ by 1). A black circle shows that the digit in one of the cells has twice the value of the other. If there is no circle between adjacent cells, neither of these properties holds. (Note: between 1 and 2, either a white or a black circle can be given.) "}
,{"id":"B2NJqj7HrL","rules":"Normal sudoku rules apply. Digits on a purple line are a set of consecutive, non-repeating digits in any order. Cells separated by white dots contain digits with a difference of one. Those separated by black dots contain digits with a 1:2 ratio."}
,{"id":"B2nt9qTFp9","rules":"Within the main 9x9 grid, normal sudoku rules apply. Numbers along an arrow must sum to the number in the circle. Shade cells within the main 9x9 grid so that the clues outside the grid equal the sums of the digits in contiguous blocks of shaded cells in that row/column. Blocks must be separated by at least one unshaded cell.  Note: The number of clues for a particular row/column is exactly the number of white cells outside the grid for that row/column. (For example, column 7 has three white cells outside the grid, so there are exactly three clues for column 7.) Also, numbers outside the main 9x9 grid don't have to adhere to normal sudoku rules: they can be greater than 9 (including in an arrow's circle), and can repeat in the row/column, etc."}
,{"id":"B3Rd8LDrdQ","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Clues outside the grid give the sum of the digits along the indicated diagonal.  (Such digits may repeat if allowed by normal sudoku rules.) In this puzzle, for each total exactly one of the cages or little killers with that total is wrong.   "}
,{"id":"B4Gb6RMDmf","rules":"Normal sudoku rules apply. Digits increase along thermos from the bulb."}
,{"id":"B76mMpPdQQ","rules":"Normal sudoku rules apply. Along thermometers, digits must strictly increase from the bulb.  Clues outside the grid show the sum of the digits on the indicated diagonal, which may include repeats."}
,{"id":"BFRF9D8QjP","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Clues outside the grid give the sum of the digits along the indicated diagonal. Digits can repeat along such a diagonal if allowed by other rules."}
,{"id":"BGDJ3tD8Fg","rules":"Normal sudoku rules apply. Thermometers act like accelerometers: the difference between two consecutive digits on a thermo must increase from the bulb end (e.g. 1-2-4-9 is a valid thermo but 1-2-3-9 is not)."}
,{"id":"BMm4LGNQ7M","rules":"Normal Sudoku rules apply. Place the digits 1 through 9 in each empty cell. Digits must not repeat within the same row, column, or box.  A black dot between cells indicates cell values with a 2:1 ratio. A white dot between cells indicates cells with consecutive values. Not all dots are shown."}
,{"id":"BN4DmbjQ8L","rules":"Normal sudoku rules apply. In cages digits must sum to the small clue in the top left corner of the cage. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"BQf98jFLqh","rules":"Normal sudoku rules apply. A clue outside the grid shows the sum of the digits sandwiched between 1 and 9 in that row or column. Digits on a line must be between the digits in the circles connected by the line. (The cluster of between lines is a copy of the shape in Cracking the Cryptic's YouTube channel banner, hence 'Cracker' in the title of the puzzle.)"}
,{"id":"BdG6DPp6pL","rules":"Normal sudoku rules apply. For any digit (x) that appears in a circle, both immediately consecutive digits (i.e. x-1 and x+1) must appear x cells away in a direct line along its row and/or column (but not diagonally). For the purposes of this rule, 1 and 9 are considered to be consecutive. "}
,{"id":"BfQ9HBtQp8","rules":"Normal sudoku rules apply. Digits joined by black dots have a ratio of 1:2; digits joined by white dots are consecutive; digits joined by X sum to 10; digits joined by V sum to 5. Not all dots, X's and V's are given."}
,{"id":"Bg6rfFNt9G","rules":"Normal sudoku rules apply. Digits along arrows sum to the number in the circle/pill. 2-digit numbers in pills are written left-to-right."}
,{"id":"BgfQH6Hbg6","rules":"Normal sudoku rules apply, and identical digits cannot appear within a knight's move of each other. Cages cannot include repeat digits, and show their sums."}
,{"id":"BgqJ2q46FL","rules":"Normal sudoku rules apply.  Digits cannot repeat within a cage.  Every cage contains digits that sum to the same total."}
,{"id":"BhrRNgL2Bn","rules":"Normal sudoku rules apply. Digits increase along thermometers from the bulb. Digits on an arrow sum to the number in the circle. A clue outside the grid shows the sum of the indicated diagonal. Two orthogonally neighbouring cells can never sum to 7."}
,{"id":"Bjrn4rQ2bH","rules":"A value in a circle tells you how many of the four cells surrounding that circle contain even digits. (The even digits around a circle don't have to be different from each other, as long as they follow sudoku rules.) "}
,{"id":"BnRMNhBr8N","rules":"Normal sudoku rules apply.  Along thermometers, digits must increase from the bulb end."}
,{"id":"D4mmRBrG4G","rules":"Normal sudoku rules apply.  Cells that are a chess knight's move apart must not contain the same digit. In cages, digits must sum to the small clue in the top left corner of the cage. Digits cannot repeat within a cage."}
,{"id":"D6gtMgFQbT","rules":"Normal sudoku rules apply. Adjacent digits along blue lines must differ by at least 5. Purple lines contain a consecutive series of digits (in any order)."}
,{"id":"DFNBq8T6hj","rules":"Normal sudoku rules apply. Digits may not repeat within a cage. In cages, digits must sum to the small clue in the top left corner of the cage. Digits on a thermometer must increase from the bulb end."}
,{"id":"DLDmBffGrG","rules":"Normal sudoku rules apply. The grey 3x3 boxes are magic squares, with each 3-cell row, column and diagonal summing to the same total. The contents of each cage are each pair of 2 different digits which sum to the small number in the top left corner (so a cage with a clue of 6 would have to contain 1,2,4,5)."}
,{"id":"DLFMNqR3H9","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Even digits must see at least one identical digit by a knight's move (in chess)."}
,{"id":"DOUBLEBOBBINS","rules":"Normal Sudoku rules apply. Digits must be strictly increasing from the bulb to the end for grey thermometers, and super-increasing for red thermometers."}
,{"id":"DRTfdmptP8","rules":"Normal sudoku rules apply.  Cells separated by a knight's move (in chess) cannot contain the same digit.  Digits on blue lines must be strictly between the digits in the circles at either end."}
,{"id":"DbqfnTp2hR","rules":"Normal sudoku rules apply.  Digits along an arrow must sum to the digit in that arrow's circle. Cells separated by a black dot have a ratio of 1:2.  Cells separated by a white dot have a difference of 1.  Not all dots are given."}
,{"id":"Df2Q4M7pML","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Odd digits(1, 3, 5, 7, 9) can appear consecutively for more than two cells vertically, but not more than two cells horizontally. Even digits(2, 4, 6, 8) can appear consecutively for more than two cells horizontally, but not more than two cells vertically.  "}
,{"id":"DfPhM8T7bD","rules":"Normal sudoku rules apply. Digits on an arrow sum up to the digit in the circle of that arrow. Clues outside the grid indicate the sum of the digits along the indicated diagonal.  Digits can repeat along such a diagonal."}
,{"id":"DgR37JjRqG","rules":"Normal sudoku rules apply. Any two digits next to each other on a line must have a difference of at least 5."}
,{"id":"DgqqmmghFg","rules":"Normal sudoku rules apply. Each marked diagonal contains only three distinct digits."}
,{"id":"Dh3pfFLfnJ","rules":"Normal sudoku rules apply. Numbers in the circled cells represent sandwich clues. A horizontal capsule will be read left to right and tells the sum of the numbers between the 1 and 9 in that row. A vertical capsule is read top to bottom and indicates the sum of the cells between the 1 and 9 in that column. A single cell will be a sandwich clue in either its row or column - you must determine which."}
,{"id":"DhF88nPTP4","rules":"Normal sudoku rules apply.  Digits along an arrow must sum to the digit in that arrow's circle. A cell containing an opaque grey square must contain an even digit.  A cell containing an opaque grey circle must contain an odd digit."}
,{"id":"DjqHD2n3jg","rules":"Normal sudoku rules apply. Digits cannot repeat in cages, except blue ones. All cages sum to a perfect square or cube, and these sums are allowed to repeat once each."}
,{"id":"Dm4HRqnL7p","rules":"Normal sudoku rules apply.  Digits along each line must be a set of consecutive digits in any order and must not repeat. Clues outside the grid give the sum of the digits sandwiched between the 1 and the 9 in that row/column. Inequality signs point to the smaller digit of the two connected cells."}
,{"id":"DnPM6Jdm4g","rules":"Normal sudoku rules apply. Arrows in a cell indicate that the Nth cell from the clue cell contains the same digit in both directions, with N being the digit in the clue cell."}
,{"id":"DnhfRLQ8FF","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Grey lines in the grid are palindromes, which must read the same forwards and backwards. The clue outside the grid gives the sum of the digits along the indicated diagonal.  Digits can repeat along the diagonal if allowed by other rules. Cells separated by a white dot must contain consecutive digits.  Cells separated by a black dot must be in a 1:2 ratio.  Not all possible dots are given. Cells with a grey circle contain an odd digit."}
,{"id":"DrDLbHmj6h","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb to the tip, but where the thermo tips are must be determined. Digits joined by a white dot are consecutive; digits joined by a black dot have a 1:2 ratio. Not all dots are given."}
,{"id":"DrGBD39bD9","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"DrpgPndfDd","rules":"Normal sudoku rules apply. Each line contains a set of consecutive, non-repeating digits, in any order.  Cells with a grey circle must contain an odd digit."}
,{"id":"DtNtMFM6gF","rules":"Normal sudoku rules apply. Digits in cages must sum to the number at the top-left of the cage. The cage totals of blue cages come from the crime scene investigation and are always correct. The cage totals of purple cages come from interviewing suspects and may be either correct or off by 1. Digits may not repeat within cages."}
,{"id":"DtjRtL6Rrr","rules":"Normal sudoku rules apply. Clues outside the grid show the sum of the indicated diagonal, which may include repeats. Digits along arrows sum to the number in the circle/pill. In the pill the number is written left-to-right."}
,{"id":"F3NGgR7RnB","rules":"Normal sudoku rules apply.  No two cells in the same position within a box can contain the same digits.  (Eg r1c4 and r7c7 must be different as both occupy the first cell of their boxes).  The cells separated by the black dot have a ratio of 2:1.  (Not all possible dots are given).  Digits on a purple line must be between the circled digits at the line's ends.  The upper right vertical line is an arrow.  The digit in that circle is the sum of the digits along the arrow."}
,{"id":"F4ThRDdQRp","rules":"Normal sudoku rules apply. The grid contains a 1-cell wide loop of orthogonally-connected cells.  The loop may touch itself diagonally but not orthogonally.  The digit in a cell with an arrow indicates how many loop cells are in the direction of the arrow (not counting the cell containing the arrow).  Arrow cells may be on the loop path.  All possible arrows are given (so if a cell could have an arrow it MUST have an arrow).  In cages, the small clue in the top left corner of the cage gives the sum of all cells in that cage that are on the loop path. Digits cannot repeat within a cage. "}
,{"id":"F4pq8732pq","rules":"Normal sudoku rules apply. Digits along a purple line must form a set of consecutive digits with no repeats (in any order). Along a green line, digits differ from their neighbors by at least 5."}
,{"id":"F7LgFMbFTn","rules":"Normal sudoku rules apply.  Digits cannot repeat within a cage and must sum to the value indicated."}
,{"id":"FDtFbt7HM4","rules":"Normal sudoku rules apply. Digits in a green cell and the next green cell in the same column or row must sum to a digit in one of the cells between them."}
,{"id":"FFgDG29LgR","rules":"1-9 must be placed in each row, column and marked region. Digits in cages do not repeat and sum to the totals given. Digits along arrows sum to the number in the attached circle. A clue outside the grid shows the sum of the indicated diagonal, which may contain repeat digits"}
,{"id":"FGHJh9tPqT","rules":"Normal sudoku rules apply. Digits along lines separated by grey circles must have values in between those in the circles. Digits along a purple line must form a set of non-repeating consecutive digits in any order."}
,{"id":"FHN86gdPDb","rules":"Normal sudoku rules apply. Digits in a grey circle must be odd. Digits in a grey square must be even. Cells separated by a black dot always have the same ratio which must be discovered by the solver. Cells separated by a white dot always have the same difference which must be discovered by the solver."}
,{"id":"FLqFBMpTJB","rules":"Normal sudoku rules apply. Along thermometers, digits must increase from the bulb end. Digits along an arrow must sum to the digit in that arrow's circle. The clue outside the grid gives the sum of the digits along the indicated diagonal.  These digits may repeat if allowed by other rules.  The main diagonal marked in blue cannot contain a repeated digit. Digits on the diamond endpoints of a purple line must have a difference of at least 4 and the remaining digits on the line cannot be between or equal to the digits on the endpoints."}
,{"id":"FNGQ7RFfjN","rules":"Normal sudoku rules apply. Digits do not repeat in cages, which show their sums. Two cells joined by an X must sum to 10  not all X's are given."}
,{"id":"FPMM9Hn3Fg","rules":"Normal sudoku rules apply. A white dot joins two consecutive digits. All white dots may not be given."}
,{"id":"FPPb3T2JqT","rules":"Normal sudoku rules apply. Along thermometers, digits must increase from the bulb end. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"FQDpNL27R2","rules":"Normal sudoku rules apply. A clue outside the grid shows the sum of the digits sandwiched between the 1 and the 9 in that row/column. Digits along an arrow (which may repeat) average exactly to the digit in the attached circle."}
,{"id":"FQr78jpf86","rules":"Apply classic sudoku rules. Clues outside the grid indicate the sum of the first set of all ascending digits, starting from the first cell from the corresponding side. Sets may consist of only one digit."}
,{"id":"FTdq68MLg7","rules":"Normal sudoku rules apply. Digits along an arrow sum to the digit in that arrow's circle. Along thermometers, digits must increase from the bulb end."}
,{"id":"FbFqNLGhND","rules":"Normal sudoku rules apply.  Digits cannot repeat on each main diagonal (marked in blue). Digits along arrows sum to the digit in that arrow's circle. Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat along such a diagonal if allowed by other rules."}
,{"id":"FjNPfrp29T","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. The grey lines are palindromes (ie they must read the same in both directions). The indicated diagonal sums to 45 - digits may repeat along this diagonal.  Cells a 'camel move' apart may not contain the same digit.  A camel move is like an elongated knight in chess - it makes a {1,3} jump."}
,{"id":"Fjt3rLqG2r","rules":"Normal sudoku rules apply. Digits along a thermometer increase from the bulb. Digits joined by an X sum to a total of 10. Digits joined by a V sum to a total of 5. All possible X's and V's are given."}
,{"id":"Fm9HLrhJ69","rules":"Normal sudoku rules apply. For each line, digits have an equal sum within each box the line passes through. eg For the line starting in r6c1, the sum of the box 4 digits must equal the sum of the box 7 digits ie r6c1 + r6c2 = r7c2 + r8c2 + r8c3."}
,{"id":"FmD4JTL79p","rules":"Normal sudoku rules apply. Digits cannot repeat within a cage. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"FmTJm94bMR","rules":"Normal sudoku rules apply.  Cells separated by a knight's move (in chess) cannot contain the same digit.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"FmjLRJrr7d","rules":"Normal sudoku rules apply (1-9 appears in each row, column and 3x3 box)."}
,{"id":"Fp2Tn37qnG","rules":"Normal sudoku rules apply. Digits along thermos must increase from the bulb. Digits along arrows sum to the number in the circle."}
,{"id":"Fp4tJQJrmF","rules":"Normal sudoku rules apply, and no digit appears in the same position within two 3x3 boxes. Cages show their sums. The grey line is a palindrome, which reads the same in either direction."}
,{"id":"Fqp4G8Q8mb","rules":"Normal sudoku rules apply.  Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat along these diagonals if allowed by other rules.  Digits in cells containing a grey circle must be odd."}
,{"id":"FrTbGnTHGt","rules":"1-6 appear in each, row and region. A white circle between two cells shows that the digits in those cells are consecutive; a black circle shows that the digit in one of the cells has twice the value of the other. Not all possible circles are given."}
,{"id":"G38HfgRGdf","rules":"Normal sudoku rules apply. Cells that are a chess knight's move apart cannot contain the same digit."}
,{"id":"G4fp4rbMFf","rules":"Normal sudoku rules apply. Digits along a thermometer must increase starting at the bulb end."}
,{"id":"G7MfBMnB8h","rules":"1-6 must appear in each row, column and box. Digits on a marked diagonal must not repeat. If two cells in any two grids have the same letter written in them, those cells must contain the same digit."}
,{"id":"G7Nh7pnNmR","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb. A number in a circle must appear in one of the cells touching that circle."}
,{"id":"G8q3Dbj2rt","rules":"Each row, column, region and marked diagonal must contain the digits 1-9. Numbers along an arrow must sum to the number shown in the circled cells. Cells with grey circles must contain odd numbers. Cells with grey squares must contain even numbers. A black dot joins digits with a ratio of 1:2. A white dot joins consecutive digits. Not all dots are given."}
,{"id":"G8r4LHFFBd","rules":"Each row, column, and region must contain the digits from 1 to 9 exactly once. Each region is formed of 9 orthogonally-connected cells and must be determined by the solver. Clues outside the grid show the sum of the two digits separated by the first region border seen from that direction in that row/column. (A row or column with a clue cannot be occupied by a single region.) For example; if the regions were the regular 3x3 boxes, then the clue at the top of column 6 would be the sum of R3C6 and R4C6, and the clue at the bottom of column 6 would be the sum of R6C6 and R7C6."}
,{"id":"G9J68BT9Tj","rules":"Normal sudoku rules apply. Digits in a cage must not repeat, and sum to the number in the top left corner. Adjacent digits along a green line have a difference of at least 5."}
,{"id":"G9mBNJr24F","rules":"Normal sudoku rules apply. Digits inside grey bubbles must be odd.  Digits separated by a white bubble are consecutive.  Digits separated by a black bubble have a ratio of 1:2.  Not all bubbles are given."}
,{"id":"GBdTMfhnMF","rules":"Normal sudoku rules apply. Cages show their sums, and contain no repeated digits. Clues outside the grid show the sums of the marked diagonals, which can include repeats."}
,{"id":"GDrLhdGdgh","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Adjacent digits on the green line must differ by at least 5."}
,{"id":"GFR6d27hP9","rules":"Normal sudoku rules apply.  Digits along an arrow must sum to the digit in that arrow's circle. Those digits along an arrow are a consecutive non-repeating set in any order."}
,{"id":"GFhGQN4fB3","rules":"Normal sudoku rules apply."}
,{"id":"GGH6bDd2dG","rules":"Normal sudoku rules apply. Digits cannot repeat in a cage; cages show their sums. Along a spiral, there will be no repeated digit in any pair of successive cages. Inequality signs point to the smaller number."}
,{"id":"GGQQBpHgHm","rules":"Normal sudoku rules apply. And that's it!"}
,{"id":"GJ824F3qq4","rules":"Normal sudoku rules apply. Digits in green cells sum to 77.  Adjacent digits on a grey line must differ by at least 4."}
,{"id":"GJbrQ3j6Bp","rules":"In all three grids, 1-6 must appear in each row, column and marked region. In grid 2, digits must increase along thermometers from the bulb end. In grid 3, digits in cages cannot repeat and must sum to the total given. Blue cells contain the same digit in the same order in grids 1 and 2. Orange cells contain the same digit in the same order in grids 2 and 3."}
,{"id":"GLFmHPbrmh","rules":"In each of the 5 4x4 grids, 1-4 must be placed in each row, column and 2x2 region. Digits along the between line must have values between those of the ends of the line. Digits joined by a black dot have a 1:2 ratio; digits joined by a white dot are consecutive. Not all dots are given. Digits along an arrow must sum to the digit in the circle. Digits along a thermo must increase from the bulb."}
,{"id":"GMmTTqFhp2","rules":"Normal sudoku rules apply. The blue areas represent the water surrounding the Wirral Peninsula. The green areas are land. On land, the digit in a cell represents the height of a skyscraper built in that cell. No skyscrapers can be built on water, so any digit can appear on water without affecting sightlines. Sightlines to a shorter building are blocked by taller buildings. The cages represent places where photographs were taken by a photographer on a boat cruise. The small arrow in a cage represents the direction the photographer was facing. Additionally, the digit given in the cage represents the number of skyscrapers visible in the given direction. In places where multiple photographs were taken, all of the photographs will be clued in the same cage. The digit in the cell with a grey square is even. Note: Because no skyscrapers are built on water, no digits in those cells block sightline to any land which may be across the water from the photographer."}
,{"id":"GNb3g7F7ft","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Digits along a main diagonal (marked in blue) may not repeat."}
,{"id":"GPMDDPqNT2","rules":"Normal sudoku rules apply, and the same digit cannot appear twice in the same position within two 3x3 boxes. Digits increase along a thermo from the bulb. Digits do not repeat in cages. A black dot joins digits with a 1:2 ratio. Not all dots are given."}
,{"id":"GPf6JTG4G6","rules":"Normal sudoku rules apply. Along purple lines, digits must form a sequence of non-repeating consecutive digits, in any order.  Along thermometers, digits must increase from the bulb end. Cells separated by an X must contain digits summing to 10.  Not all possible Xs are given."}
,{"id":"GR4hQnTnhP","rules":"Normal sudoku rules apply. Adjacent digits along a green line must have a difference of at least 5. In cages, digits must sum to the small clue in the top left corner of the cage."}
,{"id":"GT9f3PBhJ3","rules":"Normal sudoku rules apply. Digits cannot repeat in cages, which sum to the given clue. Digits on arrows sum to the digit in the connected circle. Clues outside the grid show the sum of the indicated diagonal. The central circle is not relevant to the solve."}
,{"id":"Gf6NmPtTqb","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage."}
,{"id":"Gf8B9FRD3h","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage.  Cells separated by a white dot must contain consecutive digits.  Not all possible dots are given.  This puzzle has a computer-verified unique solution.  Feel free to use this fact during your solve."}
,{"id":"Gh4DTqmT3T","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb. Grey circles without lines attached represent odd digits. Two neighbouring cells on an orange line must have a difference of at least 5. Clues outside the grid show the sum of the indicated diagonal, which may include repeats."}
,{"id":"Gj6rPRJhjT","rules":"Normal sudoku rules apply.  Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"GjJn7rQMd4","rules":"Normal sudoku rules apply. Digits must not repeat in a cage. The numbers in a cage must sum to the given total in the top left corner. Numbers along an indicated diagonal must sum to the given total."}
,{"id":"Gn497f83tF","rules":"Normal sudoku rules apply. Digits along a line, which may include repeats, must be strictly between the values in the circles on the ends of that line."}
,{"id":"Gn9FmJ4q23","rules":"Normal sudoku rules apply. An X joins two cells which sum to 10. A V joins two cells which sum to 5. All Xs and Vs are given."}
,{"id":"GnhM7ppj24","rules":"Normal sudoku rules apply. Along thermometers, digits must increase from the bulb end. Along blue lines, successive digits must differ by at least 6."}
,{"id":"Gt3hGDt7GJ","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Cells containing an opaque grey circle must contain an odd digit."}
,{"id":"H3Jt9J2fdg","rules":"Normal sudoku rules apply. Grey squares are walls and green squares are cave.  Some of the cells must be coloured grey so that all grey cells (the walls) are orthogonally connected to the edge of the grid and all other (green) cells form an orthogonally connected area (the cave). A clue in the top left corner of a cell indicates the sum of the digits that are seen from this cell looking to the north, south, east and west. The cell with the clue counts once towards this sum.  Walls obstruct the view.  A cell with a clue must be part of the cave.  Within the field of vision of a clue, digits may not repeat."}
,{"id":"H48M7RbPdG","rules":"Normal sudoku rules apply. Neighbouring digits on an orange line have a difference of at least 5. Digits on a blue line form a set of consecutive, non-repeating digits in any order."}
,{"id":"H8JHPgbjtj","rules":"Normal sudoku rules apply. Digits may not repeat on either main diagonal (marked in blue). In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. The clue outside the grid gives the sum of the digits on the indicated diagonal.  Digits may repeat along this diagonal if allowed by other rules."}
,{"id":"H8fbgF24Fn","rules":"Normal sudoku rules apply. Digits along arrows sum to the number in the attached circle."}
,{"id":"H969Dr8nPH","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Digits along an arrow must sum to the digit in that arrow's circle.  Cells separated by a knight's move (in chess) cannot contain the same digit."}
,{"id":"H9QDg4N2FP","rules":"Normal sudoku rules apply. Digits on a line must be strictly between the values of the digits in the associated circles. Clues outside the grid show the sum of the indicated diagonal, which may include repeats."}
,{"id":"HB3RHhhRJF","rules":"Normal sudoku rules apply. Every cage must fold into a legitimate dice, where opposing faces sum to 7.  Cells with a grey circle contain an odd digit.  Cells separated by a white dot contain consecutive digits.  Not all possible dots are given."}
,{"id":"HBfmTF8rTp","rules":"Normal sudoku rules apply. Digits in cages must sum to the value in the top left corner of the cage. Digits along arrows must sum to the digit in the attached circle. The digits connected by a white dot must be consecutive. Not all dots are shown."}
,{"id":"HD9TQDhLqp","rules":"Normal sudoku rules apply. A pair of orthogonally neighbouring cells cannot be read as a square number, in any direction. Hence, no 1 can ever neighbour a 6, etc. The marked cages each sum to a square number."}
,{"id":"HMBLdFQ7FT","rules":"Normal sudoku rules apply. Purple lines must contain a set of consecutive, non-repeating digits. Cells separated by an X must contain digits summing to 10; not all possible Xs are given. The clue outside the grid gives the sum of the digits along the indicated diagonal; these digits may repeat if allowed by other rules. "}
,{"id":"HPh3njgLdr","rules":"Normal sudoku rules apply. Digits in cages sum to a number that ends in 5. Digits cannot repeat within a cage."}
,{"id":"HRhmB9N2n6","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the circle. Clues outside the grid show the sum of digits between the 1 and the 9 in that row/column."}
,{"id":"HTF4Hn8rj8","rules":"Normal sudoku rules apply. Cells separated by a knight's move (in chess) cannot contain the same digit. Cells separated by a black dot must contain digits in a ratio of 1:2 (ie one is double the other). Cells separated by a white dot must contain consecutive digits. Not all possible dots are given."}
,{"id":"Hg6jH2L9fb","rules":"Normal sudoku rules apply. Digits may not repeat along either main diagonal (marked in blue). In cages, digits sum to the small clue in the top left corner of the cage. Along thermometers, digits must increase from the bulb end."}
,{"id":"Hh7BP9jBBG","rules":"Normal sudoku rules apply. Identical digits cannot be a knight's move apart. Digits along an arrow sum to the number in the circle, and can include repeats."}
,{"id":"HhQT427HGN","rules":"Normal sudoku rules apply. Each grey line contains a set of consecutive, non-repeating digits, in any order. Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat on such a diagonal if allowed by other rules."}
,{"id":"HjjFg946HD","rules":"Normal sudoku rules apply. Cages cannot contain repeated digits, and their sum may be given. Clues outside the grid show sums of the indicated diagonals, in which digits can repeat. Digits along arrows sum to the number in the circle."}
,{"id":"HmH3fqrPr9","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the circle. Lines are palindromes, reading the same each way. Dots join cells with a ratio of 1:2 or 1:3, as marked. Not all dots are shown. Grey cells are larger than the orthogonally surrounding digits."}
,{"id":"Hn9pDFjG8N","rules":"Normal sudoku rules apply.  Cells separated by a knight's move (in chess) cannot contain the same digit. Digits along arrows must sum to the digit in that arrow's circle."}
,{"id":"HqTBn3Pr6R","rules":"Normal sudoku rules apply. Digits cannot repeat in cages, which show their sum."}
,{"id":"Hrbb6dRLqp","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Each small purple circle represents a watchtower of height X, where X is the digit in that cell. Each watchtower must see exactly X cells (including itself) in its row and column combined. Watchtowers cannot see digits larger than their own height, nor past them. Not all watchtowers are given but cells with purple squares must not be watchtowers and they must therefore see more or less than X cells. "}
,{"id":"Ht8GBQBp9d","rules":"Normal sudoku rules apply. For each line, it has an equal sum in each box it passes through.  Eg for the line that starts in r4c3: r2c5+r3c4 = r2c3 + r3c3 = r4c3."}
,{"id":"J2HhJ9Pb9t","rules":"Normal sudoku rules apply. On thermometers, digits increase from the bulb end. Digits linked by a blue thread sum to 6.  Digits linked by a purple thread sum to 14.  Repeats are allowed on the sum threads."}
,{"id":"J3nbjRB8H8","rules":"Normal sudoku rules apply. Digits do not repeat in cages, which show their sums in the top left-hand corner."}
,{"id":"J78HMmfg6b","rules":"Normal sudoku rules apply. Digits on arrows sum to the total in the circle. Cells joined by a black dot have a ratio of 1:2; not all dots are shown. Row 5 text is just aesthetic."}
,{"id":"J7HNpQqNG9","rules":"1-9 must be placed in each row, column and marked shape. Digits above a column must be entered into it with at least one cell between each digit and in the given order (top to bottom)"}
,{"id":"J9DrmNTHgf","rules":"Normal sudoku rules apply. Digits joined by a white dot must be consecutive; digits joined by a black dot must have a 1:2 ratio. Not all dots are given. Digits do not repeat in cages, which may show their sums. All odd digits in the puzzle are orthogonally connected forming a single 'body of water', but may never gather in a 2x2 square."}
,{"id":"JBNhmrn8dq","rules":"Riddle: A long hallway has 43 light bulbs on the ceiling. Each light bulb has a pull cord that turns it on and off. All the lightbulbs start turned off. 43 people go down this hallway. The first person pulls every cord: 1,2,3,4... (now all bulbs are on) The second person pulls every other cord: 2,4,6,8... The third person pulls every third cord: 3,6,9,12... And so on with the rest. Finally the 43rd person pulls cord 43. Which bulbs are on after all the people have passed through? Feel free to use the Sudoku Grid to work out the answer.  Sudoku: Mark the final lit up bulbs in the Sudoku grid. (The hallway starts with Bulb 1 in R1C3) Lit hallway cells are brighter (higher) than their hallway neighbors. Hallway cells get darker (lower) as you get further away from a lit cell. Between every two lit cells in the hallway there will be a darkest (lowest) cell. It can be anywhere between the two lit cells. Arrows show the way through the hall. Digits along an arrow sum to the circled digit."}
,{"id":"JGPFmGQqMT","rules":"Normal sudoku rules apply.  In the grid, every cell is part of an 'Omino', consisting of all 12 different Pentominoes, all 5 different Tetrominoes and 1 Monomino.  Ominoes cannot overlap and digits cannot repeat within an Omino.  The sum of the digits in each Omino must be divisible by the number of cells in that Omino.  The 1-cell cage clues each mark the leftmost cell of the top row of an Omino, and this Omino sums to the value of that clue.  The digits along a grey line form a sequence of consecutive digits but may appear in any order.  Each line cannot be part of more than one Omino."}
,{"id":"JH2bJNGmqF","rules":"Normal sudoku rules apply. Digits increase along thermometers from the bulb."}
,{"id":"JH8hqjFfD9","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. The cages themselves must be deduced; each cage contains a 'renban' that spans ALL of its cells.  The line must start at the killer cage sum clue and move horizontally and vertically through cells (but not diagonally).  The line must not branch.  NB As usual, the killer cage total must always be in the upper left corner of the cage (uppermost prioritised over leftmost). Cells connected by a 'renban' line must contain consecutive digits in any order.  Cages may not overlap."}
,{"id":"JMF2qDtbDG","rules":"Normal sudoku rules apply.  Cells containing a grey circle must contain an odd digit.  Cells containing a grey square must contain an even digit.  Digits in a cage may not repeat.  The digits in the cage sum to the cage total.  The digits of the cage total indicate how many odd and even digits are in the cage (in no particular order)."}
,{"id":"JNDQqQ6Bfm","rules":"Normal sudoku rules apply. Along thermos, numbers either increase or stay the same from the bulb to the tip(s)."}
,{"id":"Jfdb4h38Rb","rules":"Normal sudoku rules apply. Digits in cages must sum to the total in the top left corner, if given. Clues outside the grid show the sums of the indicated diagonals, which may contain repeats, BUT the numbers for these clues are hidden in the cages as 2-digit numbers, reading left-to-right or downwards. One killer cage belongs to exactly one little killer clue and vice versa. Digits along the thermo increase from the bulb."}
,{"id":"JfjF889L8d","rules":"Normal sudoku rules apply. Digits cannot repeat within a cage.  The digits in each cage sum to a square number (eg 0, 1, 4, 9...).  Cells separated by a white dot must contain consecutive digits.  There are 9 hidden zeros in the grid, which count as 0 for the purposes of cage sums and white dots.  The hidden zeros appear once in each row, column and 3x3 box and consist of all the digits 1-9 once each.  Hidden zeros may not repeat within a cage. "}
,{"id":"Jfp7QJ8LFn","rules":"Normal sudoku rules apply. Divide the grid into sixteen pentominoes such that each small digit in the corner of a cell is the sum of the digits in its pentomino (and the central cell is not in any pentomino).  The white cells in the grid must be divided into exactly 12 pentominoes, one of each possible pentomino type.  Digits cannot repeat within a pentomino."}
,{"id":"JgdJDmG27q","rules":"Normal sudoku rules apply.  Along thermometers, digits must increase from the bulb end.  Adjacent digits on the green line have a difference of 5 or more."}
,{"id":"JgtqHpb2F6","rules":"Normal sudoku rules apply. Cells separated by a knight's move (in chess) cannot contain the same digit. Adjacent digits on a green line must have a difference of at least 5. Along the thermometer, digits must increase from the bulb end."}
,{"id":"Jj2Tt9N8f3","rules":"Normal sudoku rules apply. Each coloured line must contain a complete set of the digits 1 to 9. Digits along an arrow must sum to the digit in that arrow's circle. In cages, digits must sum to the small clue in the top left corner of the cage. Cells in rows, columns or on lines separated by a white dot must contain consecutive digits. The cell with a blue circle must contain an odd digit. The cell with a blue square must contain an even digit."}
,{"id":"Jjb694NBfP","rules":"Normal sudoku rules apply. Digits cannot repeat on the marked diagonals. Digits cannot repeat in cages, which sometimes show their sums."}
,{"id":"Jm68ttrm8q","rules":"Normal sudoku rules apply.  Each main diagonal (marked in blue) cannot contain a repeated digit.  Digits along an arrow sum to the digit in that arrow's circle."}
,{"id":"JqQHr2HJjg","rules":"Normal sudoku rules apply. Along thermometers, digits must increase from the bulb end. One cell in the grid is the nadir.  Cells must increase in value as they move away from the nadir in every straight-line direction (ie vertically, horizontally and diagonally) until they reach the edge of the grid. "}
,{"id":"Jqn4gJJftd","rules":"Normal sudoku rules apply. In cages, clues show the difference between the two digits. No two cages with the same difference can touch each other (share an edge), except as regards the question-marked cage, which DOES touch at least one cage with the same difference. Cells joined with a white dot have consecutive digits."}
,{"id":"L42H3q38P8","rules":"1-9 appear in each row, column and marked region. Cages show their sums. All instances of neighbouring cells with a difference of 4 are shown."}
,{"id":"L48t6Ppbp3","rules":"Normal sudoku rules apply. Digits can repeat in cages, which show their sums. Blue lines have only even digits with no repeats. Red lines are palindromes with only odd digits. Lines of the same length have the same sums."}
,{"id":"L6FBpNTnhN","rules":"Normal sudoku rules apply. Digits separated by a knight's move (in chess) cannot contain the same digit. Adjacent digits along a line in the grid must differ by at least 5."}
,{"id":"L82RmGGrD7","rules":"Normal sudoku rules apply. Adjoining cells joined by X sum to 10; adjoining cells joined by V sum to 5; all possible Xs and Vs are given. The 3-digit number, read left-to-right, in the pill is the sum of the digits on the connected arrow."}
,{"id":"LGLRMdDTMt","rules":"Fill each row, column and 7-cell region with the digits 1-7 once each. The boundaries of the regions must be determined. Clues in the grid indicate some of the cells that can see at least two cells in its same region both horizontally and vertically. Every digit it sees horizontally ((including itself) is summed and every digit it sees vertically (including itself) is summed and these sums have been multiplied together to give the clue. Region boundaries stop the line of sight. eg A cell with a value of 49 must be a product of 7*7, so the cell containing that clue must be able to be part of a sum horizontally to 7 as well as vertically.  So the cell could contain a 4 and have a 3 next to it horizontally; while it could have a 1&2 above and/or below it. Eg2 A cell with a value of 12 is the smallest clue possible and could be made a 1/2 in one direction and a 1/3 in the other direction."}
,{"id":"LHJg42qh9B","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. In cages, digits must sum to the small clue in the top left corner of the cage. Along the indicated main diagonal (marked in blue) digits cannot repeat. Inequality signs between two cells point to the lower of the digits in those cells."}
,{"id":"LLDprBq3FH","rules":"Normal sudoku rules apply. Green cells are 'friendly' cells ie They contain their row/column/box number; eg r5c9 could be 5(row), 9(column) or 6(box).  There are EXACTLY 2 friendly cells in every row/column/box of the grid."}
,{"id":"LLFnFB9TNG","rules":"Normal 8x8 Sudoku rules apply. Symbols outside the grid indicate that the first two digits seen in the corresponding row or column are either odd (1, 3, 5, 7), even (2, 4, 6, 8), big (5, 6, 7, 8) or small (1, 2, 3, 4)."}
,{"id":"LM92bDhjFg","rules":"Normal sudoku rules apply. The clues outside the grid indicate the sum of the first X digits placed in the corresponding row/column, where X is equal to the first digit in that row/column.  In these clues, odd digits have been replaced by O. (Zero is even.  Multi-digit clues may not start with zero.)"}
,{"id":"LNjRFLdJ2r","rules":"Normal sudoku rules apply. Digits on an arrow sum to the number in the circle. Digits in a diagonal sum to the number shown outside the grid. Cells joined by an X sum to 10. Cells joined by a V sum to 5. Cells joined by a white dot are consecutive. Not all dots, Xs or Vs are given."}
,{"id":"LQBjgh6LH4","rules":"Normal sudoku rules apply, and identical digits cannot be a knight's move apart. DIgits increase along thermos from the bulb. Digits on an arrow sum to the number in the circle. Cages show their sums and contain no repeat digits."}
,{"id":"LdgRt8ddjQ","rules":"Normal sudoku rules apply. Draw a single closed loop that travels orthogonally through the centres of some cells. The loop does not use any cell more than once and must travel through each dot. The two loop segments extending from both sides of a dot must be balanced ie the sum of the digits up to and including the digit in the cell containing the first turn must be the same. ALL possible dots are given."}
,{"id":"LfHBPF8BjP","rules":"Normal sudoku rules apply. Orthogonally adjacent cells cannot contain consecutive digits. Each line contains a set of distinct consecutive digits, which may appear in any order. Note that, in box 2, there are two lines crossing each other."}
,{"id":"Lg8hmpQhdM","rules":"Normal sudoku rules apply. Identical digits cannot be a knight's move apart. A digit never appears twice in the same position in two 3x3 boxes. A black dot joins two cells with a 1:2 ratio - not all dots are given. Digits increase on thermos, from the bulb. The clue outside the grid shows the sum of the indicated diagonal, which may include repeats."}
,{"id":"LqqPpGpbnJ","rules":"Normal sudoku rules apply. Digits along arrows must sum to the circled total. Arrows are also thermometers: digits must increase from tip to circle."}
,{"id":"LrDLmnbb29","rules":"Normal sudoku rules apply. Marked 2x2 boxes contain two digits above their 2-digit product, written left-to right. Each pair of multiplied digits is different. Inequality markers 'point' to the lower digit."}
,{"id":"Lt8N8ThFTM","rules":"Don't panic. There are several bombs hidden throughout the grid, but if you just follow these simple not at all convoluted directions you can disarm the bombs and save everyone. The bombs take the form of three regular sudoku digits which you must determine. All instances of each of those digits in the grid are bombs. Each row, column and region must contain the digits 1 to 9 once each.  There are nine regions to be discovered, each containing nine orthogonally connected cells. The arrows point at a bomb within the same region. The digit on the arrow tells you how many cells to travel to reach that bomb. For example, if r6c2 is 3, that would tell you that r3c2 is a bomb digit in the same region as r6c2. Not all arrows are necessarily given. The black dots in the grid separate digits with a ratio of one to two which are in different regions. All such black dots are given. [Digits with a ratio of one to two that are in the same region are not marked.]"}
,{"id":"M3M3d3hDpJ","rules":"Normal sudoku rules apply. Cells separated by a knight's move (in chess) cannot contain the same digit. Digits along an arrow sum to the digit in that arrow's circle."}
,{"id":"M6drp6dh8g","rules":"Normal sudoku rules apply. Where a circle is given in the grid, the digits in the circle must appear in the four cells surrounding the circle."}
,{"id":"M7N3GPRjtJ","rules":"Normal sudoku rules apply. The digits XYZ in pills (reading left to right) signify that rowX,columnY = Z"}
,{"id":"M7Q2pGBFQf","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage."}
,{"id":"M83Hj6DRQh","rules":"Normal sudoku rules apply. Along thermometers, digits must increase from the bulb end. Digits along an arrow sum to the digit in that arrow's circle. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"MDRqntJQg4","rules":"Normal sudoku rules apply. Clues outside the grid give the sum of the digits along the indicated diagonal.  These digits may repeat if allowed by other rules. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"MF3rQB3Tgr","rules":"Normal sudoku rules apply. A digit in a circle must appear in at least one of the four cells surrounding that circle. Every even digit must see at least one identical digit via a knight's move (in chess).  Eg if r5c2 is a 2 then there must be at least one 2 in r3c1, r3c3, r4c4, r6c4, r7c3 and r7c1. "}
,{"id":"MFtLb8tfTM","rules":"Normal sudoku rules apply. Cages show their sums. The two grey shapes are exact clones of each other."}
,{"id":"MLt47676Pr","rules":"In this puzzle 2-digit numbers' read from left to right or downwards. Box 1 (NW) will contain all the 2-digit square numbers (16, 25, 36, 49, 64, and 81), which may overlap but must be entirely contained within the box. Box 9 (SE) is a clone of box 1, rotated through 180. In each of boxes 3 (NE), 5 (centre) and 7 (SW), each digit will contribute to at least one 2-digit prime number contained within that box. Box 4 (W) is a magic square, with each row, column, and 3-digit diagonal summing to the same total. In each of box 6 (E) and 8 (S), the two 3-digit diagonals sum to the same number (NB box 6's number may be different from box 8's number)."}
,{"id":"MM3mMQGJn2","rules":"Normal sudoku rules apply. Digits along gray thermometers must increase from the bulb to the tip. Neighboring digits along green lines must differ by at least 5. Digits connected by a black dot must have a ratio of 1:2. Digits connected by a white dot must be consecutive. Not all dots are given."}
,{"id":"MQdm4GLpjD","rules":"Normal sudoku rules apply. Digits along thermometers increase from the bulb. Clues outside the grid show the sum of digits between the 1 and the 9 in that row/column."}
,{"id":"MRqgDj3MJR","rules":"normal sudoku rules apply. Digits along an arrow sum to the 2-digit number, written left-to-right, in the attached pill."}
,{"id":"MTTm2LtHRG","rules":"The digits 1 to 9 must appear once each in every row, column and region. A region is an orthogonally connected set of nine cells and must be determined. A region cannot contain a 2x2 block of cells. Clues outside the grid show the sum of the digits up to the next region border in that row/column. An arrow indicates a horizontal/vertical 'corridor' of cells of length N within a region, where N is the digit in that cell."}
,{"id":"MdTTpQD3dM","rules":"Normal sudoku rules apply. Numbers in circles show the difference between the cells they join. All possible differences of 4 and 8 are given."}
,{"id":"MgrpPMnbB8","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage.  Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"MhrLmh7MQG","rules":"1 to 9 must appear in each row, column, and 9-cell region. The grey square indicates an even digit. Any two orthogonally adjacent digits must have a difference of two or less."}
,{"id":"Mjb9NHH8PG","rules":"Normal sudoku rules apply. Cages show their sums. X/V join cells that sum to 10 (X) or 5 (V) - all possible Xs and Vs are given."}
,{"id":"Mp3b6jf34j","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the circle."}
,{"id":"N7fqrL2gtD","rules":"Normal sudoku rules apply. A digit in a grey cell must be greater than all of its orthogonal neighbours."}
,{"id":"N87266GQRD","rules":"Normal Sudoku rules apply. Circles are odd, squares are even. For every digit X in a cell in box Y, there is a digit Y in the same position in box X."}
,{"id":"N8nqb36Hr9","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"NB4PdB4LHR","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb."}
,{"id":"NBM4qTT4bB","rules":"Normal sudoku rules apply. Digits do not repeat along either of the (marked) main diagonals. Numbers next to each other along a green line must have a difference of at least 5."}
,{"id":"NDjdjJp2t2","rules":"Normal sudoku rules apply. Along green lines, digits must differ from their neighbors on the line by at least 5."}
,{"id":"NFBfNpmhFQ","rules":"Normal sudoku rules apply. Clues outside the grid indicate the sums of the digits in contiguous blocks in that row/column.  Cells in blocks should be shaded. Blocks must be separated by at least one unshaded cell.  Cells separated by a white dot must contain consecutive digits."}
,{"id":"NFhHj2bQ2g","rules":"Normal sudoku rules apply. Each of the following standard clue types occurs exactly three times in the grid: white dots, black dots, arrow, sandwich, Xs, Vs, thermos, quadruples, odds (grey circles), evens (grey squares), renban (purple) and German whispers (green). For each of those clue types, exactly two of the appearances of that clue are correct and the other is incorrect.  [A clue is incorrect if it is not fully correct.  Eg an incorrect quadruple might see one of the digits but not all of them.]"}
,{"id":"NFmh8mPGjG","rules":"Normal sudoku rules apply.  Cells separated by a knight's move (in chess) cannot contain the same digit. Digits cannot repeat on the main (marked) diagonals.  Digits cannot repeat within a cage. Adjacent digits on the green line must differ by at least 5. Cells separated by a black dot contain digits in a 2:1 ratio.  Not all such dots are given. "}
,{"id":"NJTDMGdrHQ","rules":"Normal sudoku rules apply. Identical digits cannot be a knight's move apart. X joins two cells that sum to 10, V joins two cells that sum to 5. Not all X's and V's may be given. The marked diagonal sums to the given number."}
,{"id":"NJbPwMVNwZ","rules":"Apply normal sudoku rules. Along thermometers, digits increase from the bulb. Along the grey german whisper lines, digits must have a difference of at least 5. The digit in the grey circle must be odd. Digits joined by a white dot must be consecutive. Not all dots are given."}
,{"id":"NLFT84hb8g","rules":"Normal sudoku rules apply. On thermometers, digits increase from the bulb end. Digits linked by a blue thread sum to 6.  Digits linked by an orange thread sum to 14.  Repeats are allowed on the sum threads."}
,{"id":"NQ8tN82JH6","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the circle. Along a thermometer, digits increase from the bulb. Exactly one 3x3 box is a magic square, in which each 3-cell row, column and diagonal sums to the same number."}
,{"id":"NRTGGTJhn8","rules":"Normal sudoku rules apply, and identical digits cannot be a knight's move apart. Clues outside the grid show the sums of indicated diagonals. Lines in the grid each contain identical digits (odd for orange, blue for even). The central 3x3 box is a magic square."}
,{"id":"Ng7p8qtbLQ","rules":"Normal sudoku rules apply.  Grey lines are palindromes and must read the same in both directions.  Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat along such a diagonal (if allowed by other rules).  No two cells in the same position relative to their box (eg r1c1 and r4c4) may contain the same digit."}
,{"id":"NgrqfFtmGB","rules":"Normal sudoku rules apply. Digits along an indicated diagonal from each question-mark may repeat and sum up to a two-digit number hidden in a killer cage (read from left to right or downwards). One killer cage belongs to exactly one diagonal clue and vice versa. Each diagonal clue is only valid in ONE of the two possible ways. White dots between two cells indicate that those cells contain consecutive digits. Not all dots are given."}
,{"id":"NmMb9Q2Rpb","rules":"Normal sudoku rules apply, and identical digits cannot be within a king's move of each other. Digits ascend along thermometers, starting from the bulb. The marked diagonal contains no repeated digits."}
,{"id":"NprLbBQGtD","rules":"Normal sudoku rules apply. A clue outside the grid shows the sum of the first X digits along that row/column where X is the first such digit. Digits on a bauble or star (circle) contain the difference between the sum of all the digits on one of the attached lines and the sum of all the digits on the other."}
,{"id":"NqFn42m976","rules":"Normal sudoku rules apply. Clues outside the grid show the sum of the digits between the 1 and the 9 in that row/column. The digit in a highlighted cell is the number of 9s in adjacent cells (including diagonally). All possible highlighted cells are given."}
,{"id":"P2MgjGj6JF","rules":"Normal sudoku rules apply. A clue outside the grid shows the sum of the digits sandwiched between the 1 and the 9 in that row/column. Cages show their totals."}
,{"id":"P39ddFHqjJ","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in its circle. Digits shown in small circles must appear in one of the adjoining cells."}
,{"id":"P4LQDq6Nqt","rules":"1-6 appears in each row, column and region. Digits cannot repeat in cages, which show their sums."}
,{"id":"P823fGjhPL","rules":"Normal sudoku rules apply and digits on a thermometer increase from the bulb end. Digits in a cage sum to the given total and do not repeat. The clue outside the grid shows the sum of the digits on the indicated diagonal. Digits in cells joined by a white dot are consecutive, and those in cells joined by a black dot have a 1:2 ratio. Not all possible dots are given."}
,{"id":"P9hRgD9393","rules":"Normal sudoku rules apply.  On each main diagonal (marked in blue) digits cannot repeat.  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage."}
,{"id":"PB6TdhDJGR","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Digits in column 1 indicate the column in which the digit 1 appears in that row (eg if r4c1 is a 6, r4c6 is a 1).  The same is true of column 5 and the digit 5, and column 9 and the digit 9."}
,{"id":"PB7bNLRffQ","rules":"Normal Sudoku rules apply. There are 12 unmarked pentomino-shaped killer cages in the grid, one of each possible pentomino type.  The cages all have different sums and cannot have repeated digits. The cages cannot overlap with each other but may touch freely. A pentomino letter in the corner of a cell indicates that this cell is part of that pentomino cage. A clue outside the grid indicates that this diagonal has the same sum as that pentomino cage. Some of the clues have been replaced by '?', indicating an unknown letter. Each pentomino cage has at most one clue of each type."}
,{"id":"PBhtdrb4Mr","rules":"Normal sudoku rules apply. Cages show their sums. The inequality sign 'points' at the lower digit."}
,{"id":"PDfjrfN9pF","rules":"Normal sudoku rules apply. Digits on an arrow sum to the number in the connected circle. Some arrows have become disconnected from their circle. (The number of unattached circles containing any given digit is the same as the number of arrows that sum to that digit.)"}
,{"id":"PHtnGmT7QF","rules":"1-9 must be placed in each row, column and marked region. Cells connected by a white dot have consecutive digits; cells connected by a black dot have a ratio of 1:2. Not all dots are given."}
,{"id":"PLhnmLPH8b","rules":"Normal sudoku rules apply. For each line, digits on the line have an equal sum N within each box the line passes through.  If a line passes through the same box more than once, each individual segment of such a line within that box sums to N separately."}
,{"id":"PMBb4hP3mm","rules":"Normal sudoku rules apply.  Cells separated by a king's move (in chess) cannot contain the same digit.  Each main diagonal (marked in blue) cannot contain a repeated digit.  Adjacent digits along the orange line must differ by at least 4."}
,{"id":"PRmP9dLgBM","rules":"Normal sudoku rules apply.  Each caged cell must be part of a region that: a) contains X orthogonally connected cells, where X is the digit placed in the caged cell; b) the cells of which sum to the small clue in the top left corner of the caged cell; c) does not contain any repeated digits.  No cell may belong to more than one region."}
,{"id":"PTD4mDNqnJ","rules":"Normal sudoku rules apply. Cells separated by a king's move (in chess) cannot contain the same digit. Cells with circles contain the sum of all diagonally adjacent digits."}
,{"id":"PdgLM2fqfH","rules":"Normal sudoku rules apply. The taxicab distance (number of orthogonal moves needed to traverse) between two identical digits must not equal that digit."}
,{"id":"Pm8N43nTMG","rules":"Normal sudoku rules apply.  Some cells have an inequality sign next to an edge.  These inequality signs point to the smaller digit of the cells that share that edge.  Dominoes of the same colour are clones:  They have the same digits at the same position in the domino.  Cells connected by a white dot contain consecutive digits.  Not all possible white dots are given."}
,{"id":"Png86rj7FG","rules":"Normal sudoku rules apply. Digits cannot repeat on either main diagonal (marked in blue). Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat along such a diagonal if allowed by other rules.  Each purple line contains a set of consecutive, non-repeating digits (which can be in any order)."}
,{"id":"Pr2DghHMj9","rules":"Normal sudoku rules apply.  Digits in a cage sum to the total indicated on the top left corner of the cage. Digits cannot repeat inside cages. The cages all have the same total which should be deduced by the solver. The killer cages themselves must be deduced and drawn by the solver. The cages can have any shape. The dotted squares in the grid show where the total of the cages are located. Note: The killer cage total must always be at the upper left corner. (Topmost prioritized over leftmost). Cages may not overlap. Clues outside the grid show the sum of all the digits that are inside killer cages in that row or column."}
,{"id":"PtD46JNLTP","rules":"Normal sudoku rules apply.  Travel around the world following the international whisper lines from Berlin to Moscow. The arrival hall at each airport (red) tells you the minimum difference between digits along the next leg of the journey, starting from the departure lounge (green).  A terminal with a white control tower must contain consecutive digits. A black control tower indicates the digits are in a ratio of 1:2."}
,{"id":"Q43b3PtDDR","rules":"Normal Sudoku rules apply. The two-digit numbers (reading left-to-right or top-to-bottom) either side of a C must sum to 100. The two-digit numbers either side of an L must sum to 50. There is no negative constraint."}
,{"id":"Q8qqFn2HJG","rules":"Normal sudoku rules apply.  Each green line contains a set of consecutive, non-repeating digits in any order.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"QBD477g7G3","rules":"Normal sudoku rules apply. Cells separated by a knight's move (in chess) cannot contain the same digit. In cages, digits must sum to the small clue in the top left corner of the cage. Digits cannot repeat within a cage. The grey line is a palindrome ie digits on the line read the same from both directions."}
,{"id":"QBTLGT3tNF","rules":"Normal sudoku rules apply. Cages show their sums. Digits increase along thermos from the bulb. The digit 1 never touches two of the same digit (including diagonally)."}
,{"id":"QFg6f67Ppd","rules":"Normal sudoku rules apply.  Digits along an arrow must sum to the digit in that arrow's circle. The green lines are 'renban' lines.  ie each line contains a set of consecutive, non-repeating digits, in any order."}
,{"id":"QH26FPT6mF","rules":"Normal sudoku rules apply. Along 'box-sum lines', digits on the line have the same sum within each 3x3 box the line passes through. The lines must be determined by the solver. All ends of lines are marked with grey dots. Lines can only move orthogonally (ie never diagonally), cannot touch themselves orthogonally, cannot branch and cannot cross themselves or other lines. Lines must start and end in different boxes and cannot re-enter boxes."}
,{"id":"QHH2q4JDJ9","rules":"Normal sudoku rules apply. 1/2/3 are marked by circles, 4/5/6 are marked by squares."}
,{"id":"QM8MB4pmD2","rules":"Normal KenKen rules apply. 1-6 appears in each row and column. Marked regions show the products of the digits within them."}
,{"id":"QMnqTL4m7f","rules":"Normal sudoku rules apply. Digits on an arrow can repeat, and sum to the number in the circle. The grey line is a palindrome, reading the same either way. The black dot joins two digits with a 1:2 ratio. Digits in grey cells are larger than their orthogonal neighbours. Prime numbers cannot be orthogonal neighbours."}
,{"id":"QQ4QgHBJBd","rules":"Each row, column, and 9-cell region must contain the digits 1 to 9 once each. Each main diagonal (marked in blue) cannot contain a repeated digit. Along thermometers, digits must increase from the bulb end."}
,{"id":"QTN4GLJFtT","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"QTjg9tFG9r","rules":"Normal sudoku rules apply.  Cells separated by a white dot contain consecutive digits.  Not all white dots are given.  The grey line is a 'Double Digit Thermometer' where it alternatives tens digits and units digits.  Starting at the bulb the double digits increase along the thermometer. All double digits added together sum to 400.  Digits along each purple line multiply to 400."}
,{"id":"QbLHMd8htg","rules":"Normal sudoku rules apply.  Cells containing a grey circle must contain an odd digit.  Cells containing a grey square must contain an even digit. In cages the sum of the even digits equals the sum of the odd digits. Digits cannot repeat within a cage."}
,{"id":"QbR6pNt3jh","rules":"Normal sudoku rules apply. Each main diagonal (marked in blue) cannot contain a repeated digit. Divide the grid into rectangular regions of orthogonally connected cells. A square is a form of rectangle. Each rectangle contains exactly one circle.  A number in a circle represents how many cells are in the rectangle the circle belongs to. Rectangles cannot overlap. Every cell in the grid is part of a rectangle. Digits may repeat in a rectangle if allowed by other rules."}
,{"id":"Qdm8h9FQfh","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits may not repeat within a cage. Along thermometers, digits must increase from the bulb end. Digits on a black dot must have a ratio of 1:2, digits on a white dot must be consecutive. Not all possible dots are given. Cells with a grey circle have to be odd, cells with a grey square have to be even."}
,{"id":"QfnM22HGtP","rules":"Normal sudoku rules apply. Lines are palindromes and the digits along each line must sum to the same total.  (A palindrome reads the same in both directions)."}
,{"id":"Qg4f4dQjmF","rules":"Diagonal lines are each sequences, not necessarily in order (renbans), of three consecutive numbers. On each plus, horizontal and vertical lines each sum to the same number (the number may be different for each plus)."}
,{"id":"Qg8946Nb7d","rules":"Normal sudoku rules apply. Cells that are a chess king's move apart cannot contain the same digit. Digits separated by an X sum to 10, and digits separated by a V sum to 5. All possible X's and V's are given."}
,{"id":"QghGGpd2ht","rules":"Normal sudoku rules apply. Along thermometers, digits must increase from the bulb end.  Digits along an arrow sum to the digit in that arrow's circle."}
,{"id":"Qj4P74ThNd","rules":"Normal sudoku rules apply."}
,{"id":"QnPHbRQqbB","rules":"Normal sudoku rules apply. The goose path from r9c2 to r1c8 is orthogonally connected, visits every cage and box and does not touch itself orthogonally or diagonally. Cages contain no repeated digits and show the total of the cells in the cage that are not on the goose path. Grey squares are not on the goose path, and show even numbers that indicate how many adjacent cells the goose visited."}
,{"id":"QpMDNMDFQq","rules":"Normal sudoku rules apply. The grey highlighted regions contain the digits 1 to 9 once each. Cells separated by a knight's move (in chess) cannot contain the same digit. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"Qr3Jq7rnLP","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage. Digits cannot repeat within a cage. On the marked (blue) diagonal, digits cannot repeat."}
,{"id":"R24FdmrfLt","rules":"Normal sudoku rules apply. A digit in a white circle may NOT appear in the four cells surrounding that circle."}
,{"id":"R3rTGMB6BT","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits along arrows must sum to the digit in that arrow's circle."}
,{"id":"R4nQFDP939","rules":"Normal sudoku rules apply."}
,{"id":"R4pBr43gb4","rules":"Normal sudoku rules apply. Digits in cages add up to the small number in the corner, if given. Digits cannot repeat within a cage. The main diagonal (in blue) must include the digits from 1 to 9 once each. Digits within the white circles must appear at least once in the four surrounding cells. Digits on arrows sum up to the number in that arrow's circle. The two digits on the two-cell-palindrome must be the same. The cell with the grey square must be an even digit. Cells separated by an X must contain digits that sum to ten. Black dots separate cells containing digits with a ratio of 1 to 2. White dots separate cells containing consecutive digits. "}
,{"id":"R6h7g8rdgf","rules":"Normal sudoku rules apply.  A cell with a grey square must contain an even digit.  A cell with a grey circle must contain an odd digit. Cells separated by a black dot must contain digits in a ratio of 1:2."}
,{"id":"R9Mb877pqm","rules":"Normal sudoku rules apply. Neighbouring digits along a grey line have a difference of at least 4."}
,{"id":"R9p6tLN9Q9","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb. Purple lines are palindromes, which read the same both ways. A number in a circle must appear in at least one of the four surrounding cells."}
,{"id":"RF9PbjJbBD","rules":"Normal sudoku rules apply. Digits in green cells sum to 77.  Adjacent digits on a grey line must differ by at least 4."}
,{"id":"RL3rDQjLHg","rules":"Normal sudoku rules apply."}
,{"id":"RLfGDg3QpQ","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Each grey line is a palindrome ie the string of digits on it reads the same in both directions (eg 1374731)."}
,{"id":"RLmT4jmJGM","rules":"Normal sudoku rules apply. All cages have distinct sums, and none contain repeat digits."}
,{"id":"RM83D8qNL9","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the circle. Neighbouring digits on a green line must have a difference of at least 5."}
,{"id":"RMpNq2BgBr","rules":"Place 2 stars in each row, column and region.  Stars cannot be placed in adjacent cells that share an edge or corner."}
,{"id":"RPLDhr2rpQ","rules":"Normal sudoku rules apply. Digits cannot repeat in cages, which show their products. The grey circle represents an odd digit."}
,{"id":"RQMpF2m6NN","rules":"Normal sudoku rules apply. Clues outside the grid show the sum of the marked diagonal, which may include repeats."}
,{"id":"RQQjRj3RPG","rules":"Normal sudoku rules apply.  The digit in the red cell (r1c1) is high [6,7,8 or 9].  The digit in the blue cell (r9c9) is low [1,2,3 or 4]. Digits along a purple line form a set of non-repeating consecutive digits (which can be in any order). Adjacent digits along a green line must have a difference of at least 5. A digit in a yellow cell must be greater than all of the orthogonally adjacent cells. "}
,{"id":"RRD8TbLqjh","rules":"Rules: Normal Sudoku rules apply. Digits cannot repeat along the marked diagonals. Digits along a thermometer must increase from the bulb. Neighbouring digits along a green line have a difference of at least 5. Digits along a purple line form a sequence, not necessarily in order. Digits joined by a black dot have a ratio of 1:2. Not all dots are given."}
,{"id":"Rhtd2M286j","rules":"Normal sudoku rules apply. The grid is a 'cylinder', continuous from the right edge to the left edge. In each row, certain cells that add to a given number are joined by a line. Any line in that row sums to the same number. The number increases, row by row, down the grid, and is shown in the blue cells in that row (a repeated number like 33 would be shown as a single digit (3), otherwise a 2-digit number reads left-to-right)."}
,{"id":"RmQ7hGm7BL","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the attached circle. A black dot joins two cells with a 1:2 ratio. All possible black dots are given."}
,{"id":"RmhNHMBJGg","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. In cages, digits must sum to the small clue in the top left corner of the cage."}
,{"id":"RpN392fqHF","rules":"Normal sudoku rules apply. Digits along an arrow much sum to the digit in that arrow's circle. Adjacent digits on a green line must differ by at least 5."}
,{"id":"Rpq6pTRDfd","rules":"Normal sudoku rules apply. Digits along thermos (grey, or red/blue) increase from the bulb. Yellow circles are odd digits. Orange lines join consecutive digits."}
,{"id":"Rqr2gJgQMr","rules":"Normal sudoku rules apply. The digits along each line must sum to 11. Digits may repeat along lines if allowed by other rules."}
,{"id":"Rr7p8BNH7R","rules":"Normal sudoku rules apply, and each coloured extra region contains the digits 1-9. Each digit occupies each possible position in a 3x3 box once."}
,{"id":"SVENARROW","rules":"Normal sudoku rules apply. Digits along arrows must sum to the digit in that arrow's circle. The positions of the circles must be determined! Blue arrows are missing a two-digit pill at one end. Orange arrows are missing a single digit circle at one end. And the purple line represents two arrows, missing a circle somewhere in the middle."}
,{"id":"T4dMrNr2pF","rules":"Normal sudoku rules apply. Digits in column 1 indicate the column in which the digit 1 appears in that row (e.g. if r4c1 is a 6, r4c6 is a 1). The same applies to columns 5 and 9, with the digits 5 and 9 respectively.  Each digit in the grid represents a skyscraper with a height corresponding to its value.  Taller skyscrapers block smaller skyscrapers from view. Clues outside the grid indicate how many skyscrapers can be seen, in total, when looking along that row or column from that direction. "}
,{"id":"TDbnnNbp9t","rules":"Normal sudoku rules apply. Digits cannot repeat in cages, which show their sums. Identical digits cannot be within a king's move of each other (i.e. cannot touch diagonally)."}
,{"id":"TFfjT3TjgQ","rules":"Normal sudoku rules apply. On thermometers, digits must increase from the bulb end.  Digits on blue lines have to be a set of non-repeating consecutive digits, in any order."}
,{"id":"TGJ629Qqm4","rules":"Normal sudoku rules apply. Digits along an arrow sum to the digit in that arrow's circle. Digits separated by a white dot are consecutive.  (Not all white dots are given).  An X between two cells indicates that those cells sum to 10.  A V between two cells indicates that those cells sum to 5.  ALL Xs and Vs are given."}
,{"id":"TMtFqgHnPp","rules":"Normal sudoku rules apply (1-9 appear in each row, column and 3x3 box)."}
,{"id":"TQGrL93NLJ","rules":"Normal sudoku rules apply. Identical digits cannot be a knight's move apart. Along thermos, digits increase from the bulb. Cages show their sums. In the original puzzle, three given digits are shown as pencil-marks. After the puzzle is finished, erase all the digits apart from 1s, slide the 1s 3 cells to the right, or 6 cells to the left, and re-solve the puzzle ignoring the pencil-marks!"}
,{"id":"TbMnngP7GJ","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Digits in circles also show the total number of cells of the same even/odd parity that that cell sees horizontally and vertically (including itself) before it hits a cell with another parity."}
,{"id":"TdBgH8fFdF","rules":"Normal sudoku rules apply. Digits in the first column indicate in which column the digit 1 is placed in the respective row.  Digits in the fifth column indicate in which column the digit 5 is placed in the respective row. Digits in the ninth column indicate in which column the digit 9 is placed in the respective row."}
,{"id":"TgFnFH8Jt8","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Digits along a purple line form a set of non-repeating consecutive digits and can be in any order."}
,{"id":"TgLHfP3LFb","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the connected circle. Yellow lines are palindromes, reading the same each way."}
,{"id":"TgrGnPpD79","rules":"Normal sudoku rules apply. Digits do not repeat in cages, which show their sums. Grey lines are palindromes, reading the same each way."}
,{"id":"TjdNrDhjd8","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits cannot repeat within a cage. The grey lines are palindromes which contain the same sequence of digits forwards and backwards. Digits in cells separated by a white dot are consecutive."}
,{"id":"TrFhNFqBLT","rules":"Normal sudoku rules apply. Along thermometers, digits must increase from the bulb end.  In cages, digits must sum to the small clue in the top left corner of the cage. Arrowed clues outside the grid give the sum of the digits on the indicated diagonal.  The (unarrowed) 21 clue outside the grid is the sum of the digits sandwiched between the 1 and 9 in its column. Cells separated by a white dot must contain consecutive digits.  Not all possible white dots are given."}
,{"id":"ZGj3EDes9m","rules":"-Normal Sudoku Rules apply\n-Additionally, there are clues scattered around the grid which correspond to sandwich clues of the same color on the outside of the grid. Each clue in the grid is either a 2 or 1 digit number, read left to right or up down, and must be determined by the solver. Once the clues have been determined, normal sandwich rules apply: clues outside the grid show the sum of the digits 'sandwiched' between the 1 and 9 in its row or column."}
,{"id":"b4qLdjD8LP","rules":"Normal sudoku rules apply. The circled number between two cells represents the difference between the two cells."}
,{"id":"b6qdJfmLb2","rules":"Normal sudoku rules apply. Grey lines are palindromes, reading the same each way. Black dots join digits with a 1:2 ratio; white dots join consecutive digits. Not all dots are shown. The grey circle is an odd digit."}
,{"id":"bGh8gpgMMd","rules":"Normal sudoku rules apply. Cells separated by a knight's move (in chess) cannot contain the same digit. Neighbouring digits on a red line have a difference of at least 5. Cells separated by a black dot contain digits in a ratio of 1:2.  Cells separated by a white dot must contain consecutive digits. Not all possible dots are shown."}
,{"id":"bGqRMb8hhp","rules":"Normal sudoku rules apply. Numbers must not repeat in a killer cage, and the numbers in the cage must sum to the given total, BUT there is exactly one cage in the grid where the condition is broken (either the sum is incorrect, or digits are repeated, or both). It is up to the solver to find out which cage is lying. The purple lines in the grid are incomplete arrows. The digit on one end of the line is the sum of the other digits on the same line."}
,{"id":"bL4Nd3T6f2","rules":"Normal sudoku rules apply. Each main diagonal (marked in blue) must contain the digits 1 to 9 once each. Cells separated by a black dot must contain digits with a 1:2 ratio.  Not all possible dots are given. Clues outside the grid give the sum of the digits along the indicated diagonal. Digits may repeat along such diagonals if allowed by the other rules."}
,{"id":"bMtQ29Qq7D","rules":"1-6 must appear in each row, column and box. Digits in a cage must not repeat, and sum to the total given. If two cells in any two grids have the same letter written in them, those cells must contain the same digit."}
,{"id":"bQbNd7dfLM","rules":"Normal sudoku rules apply. The grey lines are palindromes and must read the same forwards and backwards. In cages, digits must sum to the small clue in the top left corner of the cage. Clues outside the grid give the sum of the digits along the indicated diagonal. A black dot separates cells containing digits with a 1:2 ratio.  (Not all dots are necessarily given.)"}
,{"id":"bRdpR6rNrb","rules":"Normal sudoku rules apply. The grid consists of five 9x9 classic sudokus, with overlapping (yellow) regions."}
,{"id":"bTBmNdrjdD","rules":"In each grid, normal 6x6 Sudoku rules apply.\\n\\nThe grids are linked according to the following rule: digits that are in the same position in different grids must be different.\\n\\nTop Left: Digits strictly increase along each thermometer starting from the bulb\\n\\nTop Middle: Digits in cages sum to the given total\\n\\nTop Right: Clues give the sum of the first X digits in the row/column where X is the first digit\\n\\nBottom Left: Clues give the sum of the digits sandwiched between the 1 and the 6 in the row/column\\n\\nBottom Middle: Clues give the sum of the digits along the indicated diagonal\\n\\nBottom Right: Digits along an arrow must sum to the digit given in the attached circle"}
,{"id":"bf3bJ4r6HP","rules":"Normal sudoku rules apply. There are several digital displays in the grid; each of these must contain a valid time in 24-hour format. For example, 19:47 and 23:41 would both be fine but you can't have 17:82 or 31:45."}
,{"id":"bg6pfJFP9H","rules":"In all three grids, 1-6 must appear in each row, column and marked region. In grid 2, digits must increase along thermometers from the bulb end. In grid 3, digits in cages cannot repeat and must sum to the total given. Blue cells contain the same digit in the same order in grids 1 and 2. Orange cells contain the same digit in the same order in grids 2 and 3."}
,{"id":"bmqB8DJJ78","rules":"Normal sudoku rules apply. Digits on an arrow sum to the number in the attached circle."}
,{"id":"br8fBj3d3p","rules":"Normal sudoku rules apply. Digits along an arrow increase from the tip and sum to the number in the circle. The cage shows Jonathan's age."}
,{"id":"btFfPHhgPq","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"btgQm83JD2","rules":"Each row and column must contain the digits 1-9 exactly once, and there are nine orthogonally connected regions in the grid that also contain the digits 1-9.  Each region takes the form of a friendly serpent, which is one cell wide, 9 cells long, and does not touch itself, even diagonally.  Each serpent has a head and tail, also to be determined by the solver. Think of the head of the snake as its first cell, the next cell as the second, and so on.  A cell in the grid is circled if the digit it contains matches its position in its snake.  That is, the head is circled if it is a 1, and the tail is circled if it is a 9, and so on. ALL circles have been given."}
,{"id":"d2RMB6mjGd","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb. Clues outside the grid show the sum of digits between the 1 and the 9 in that row/column."}
,{"id":"d2THtpfPJB","rules":"Normal Sudoku rules apply. There are four 'bent diagonals' in the grid which must contain the digits 1 to 9."}
,{"id":"d6HQqjdNqf","rules":"Normal sudoku rules apply. Identical digits cannot appear within a kinght's move of each other. Digits on arrows sum to the number in the circle, and may repeat."}
,{"id":"d7Bh693gth","rules":"Normal sudoku rules apply. Clues outside the grid show how many 'buildings' can be seen in the given direction, assuming each cell is occupied by a building of the cell number's height. Buildings hide equal or smaller ones. The square is an even digit, the circle an odd one."}
,{"id":"d8Qd2dGjdL","rules":"Normal sudoku rules apply.\\nEach digit is either a multiple or a factor of an orthogonally adjacent digit."}
,{"id":"d9Rpj2d6fq","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"dD793QgjdL","rules":"Normal sudoku rules apply. Digits outside the grid give the total sum of the digits sandwiched between the 1 and the 9 in that row or column."}
,{"id":"dG8D6BBL3R","rules":"Normal sudoku rules apply. Cells in cages must sum to the small clue in the top left corner of the cage.  The number N must be determined by the solver.  Clues outside the grid indicate the sum of the digits along the indicated diagonal. Cells separated by a white dot must contain consecutive digits. The grey lines are palindromes and must read the same forwards and backwards."}
,{"id":"dGrNMrPFg7","rules":"zeroisten"}
,{"id":"dQ3QLHb6qP","rules":"Normal sudoku rules apply. Cages cannot contain repeats and show their totals. Digits on an aroow add to the number in the attached circle."}
,{"id":"dQRf4gr2TJ","rules":"Normal sudoku rules apply. Clues with arrows show the sum of the indicated diagonal, which may contain repeats. Other clues show digits which must appear in the first three cells, looking from that direction."}
,{"id":"dgj3Gj84Qh","rules":"Normal sudoku rules apply."}
,{"id":"dm2DT4MNQM","rules":"Normal sudoku rules apply. The cell with the grey circle must contain an odd digit. Every single cage in the grid must contain digits summing to an odd number. Arrows with numbers outside the grid give the sum of the digits along the indicated diagonal.  All other arrows point to diagonals that, although unclued, also sum to an odd number."}
,{"id":"dmQ8MHm29g","rules":"Normal Sudoku rules apply. Diagonals contain the digits 1-9 once. Each line is a palindrome, consisting of only 2 digits (ie: ABABA, ABBA).  "}
,{"id":"dnDqHDQNB8","rules":"Place a number from 1-7 into each empty cell so that each row, column and outlined 6-cell region contains each number at most once."}
,{"id":"dnm4b38dmB","rules":"Normal sudoku rules apply. Cells connected with V sum to 5; those connected with X sum to 10. Black dots connect digits with a ratio of 1:2; white dots connect consecutive digits. Not all clues are given. Numbers outside the grid indicate the highest number of consecutive odd digits in that row/column."}
,{"id":"dqNdpph4Gb","rules":"Normal sudoku rules apply.  Along each main diagonal (marked in blue) digits cannot repeat. In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage."}
,{"id":"dqb9NQbrj7","rules":"Normal sudoku rules apply, Along thermometers, digits increase from the bulb. Grey circles without lines represent odd digits. Neighbouring cells along green lines must have a difference of at least 5."}
,{"id":"drgFt2mrtD","rules":"Normal sudoku rules apply. Digits do not repeat in cages, which show their sums. Clues outside the grid show the sums of indicated diagonals, which can include repeat digits."}
,{"id":"f3FQJG6rbq","rules":"Normal sudoku rules apply.  Digits on a green line must differ from their neighbours on the line by at least 5.  Digits on a purple line must form a set of consecutive, non-repeating digits in any order.  Digits along an arrow must sum to the digit in that arrow's circle. Cells separated by an X must contain digits summing to 10; cells separated by a V must contain digits summing to 5.  "}
,{"id":"f4F3rNQBBr","rules":"Normal sudoku rules apply.  Divide the grid into different areas such that orthogonally adjacent areas contain different numbers of cells. Every cell is part of exactly one area.  Digits may not repeat within an area.  Numbers in the top left corner of cells are clues. An area can contain no clue, one clue or more than one clue.  All clues in an area must be identical and indicate the sum of the digits in that area.  [NB It is possible for two adjacent areas to sum up to the same total, as long as their size is different.]"}
,{"id":"f6tJLF98b9","rules":"Normal sudoku rules apply. Digits do not repeat in cages, which show their sums. A digit on a line must be somewhere between the digits in the circles on the end of the line."}
,{"id":"f8DbBpbbj7","rules":"Normal sudoku rules apply. Along thermometers, digits must increase from the bulb end."}
,{"id":"f9bDfmTtML","rules":"Normal sudoku rules apply. Each digit is represented by a different letter. Digits along the gray line form a palindrome, i.e. they read the same forwards and backwards."}
,{"id":"f9h3FHGDBn","rules":"Normal sudoku rules apply. Digits along a grey line must increase by the same amount, in the same direction."}
,{"id":"fBH6LnhR7h","rules":"Normal sudoku rules apply. Digits do not repeat in cages. Clues outside the grid show the sum of the marked diagonal, which may include repeats."}
,{"id":"fBR7n3H4Dg","rules":"Normal sudoku rules apply. Digits on a line connecting two circles must be between the digits in those circles.  (ie the digit in one circle is greater than all the digits on the line, while the digit in the other circle is smaller than all the digits on the line.)"}
,{"id":"fFfbTFNfL2","rules":"Normal sudoku rules apply. Digits in cells connected by a black dot must have a ratio of 2:1. Digits in cells connected by a white dot must be consecutive. All dots may not be given."}
,{"id":"fJNFQHTNBj","rules":"Normal sudoku rules apply. Digits separated by a black dot must have a ratio of 1:2.  Digits separated by an X must add to 10.  ALL black dots and Xs are given."}
,{"id":"fJQ8FhBQJH","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat along such a diagonal if allowed by other rules."}
,{"id":"fJnrmHf8QT","rules":"In each row and column the digits 1-9 must appear exactly once. Each cell is part of a galaxy. There are big galaxies of exactly 9 cells and island galaxies which are smaller than 9 cells. Digits can't repeat in galaxies. Each galaxy is 180 degrees rotational symmetric. In the centre of each galaxy there is exactly one circle either between 2 cells or in a cell. A circle in a cell is odd and a circle between 2 cells is a consecutive pair. Some of the circles are given, the other circles must be deduced (but all circles must have the circle properties listed above). Island galaxies can't touch each other, not even diagonally. Clues outside the grid sum the digits of the island galaxies in that row or column."}
,{"id":"fLbtDgFRhm","rules":"Fill every row, column and bold-outlined region with the digits 1-9 once each. Cells separated by an X must contain digits summing to 10. Shade one tetromino in each region such that all shaded cells form one orthogonally connected area. Tetrominoes of the same shape may not share a border (counting rotations and reflections as the same). No 2x2 area may be entirely shaded. Additionally, each tetromino must contain digits summing to less than 13."}
,{"id":"fLtm97H9GD","rules":"Every digit from 1 to 9 must appear once in every row, column and region. Each region must be determined and each is a set of nine orthogonally connected cells. A digit in a circle indicates the number of borders between regions it sees in its row and column. Note that the edge of the grid does not count toward this total.  Not all possible circles are necessarily given."}
,{"id":"fPB7jpgLm8","rules":"Normal sudoku rules apply. There is a secret five digit number.  The coloured cells in a row, read left to right as a five digit number, represent a guess at the secret number. If a cell is green, that digit is in the secret number and in the correct position; if a cell is yellow, that digit is in the secret number but in the wrong position; if a cell is grey, that digit is not in the secret number. Cells separated by a black dot must contain digits in a 1:2 ratio. Cells separated by a white dot must contain consecutive digits.  Not all dots are given."}
,{"id":"fPh2g4jNhp","rules":"Normal sudoku rules apply. Each digit is represented by a different letter. Digits along the gray line form a palindrome, i.e. they read the same forwards and backwards."}
,{"id":"fdBbF4dTDF","rules":"Normal sudoku rules apply. There are two snakes in the grid, the endpoints of which are given (as circles). Snakes cannot touch themselves or each other orthogonally but they can touch diagonally. Adjacent digits along a snake must differ by at least 5. The non-snake cells form several regions. In regions, digits cannot repeat. Some region totals have been indicated by small corner clues. The given digits indicate the number of snake cells within the 3x3 square centered on that digit. "}
,{"id":"fj78pdJMhT","rules":"Normal sudoku rules apply. Where a black square appears, the pairs of digits connected diagonally have a ratio of 1 to an integer, but not the same one. A black circle means the pairs of digits connected diagonally have the same ratio of 1 to an integer. Pairs of digits connected diagonally by white squares never have a ratio of 1 to an integer. Digits along an arrow sum to the digit in the circle."}
,{"id":"fjhJTgjhJ6","rules":"Normal sudoku rules apply. Digits along thermometers must increase from the bulb. White dots join cells which have consecutive digits. Not all dots are given."}
,{"id":"fpmB4ppfMp","rules":"Normal sudoku rules apply.  Cells separated by a white dot contain consecutive digits.  Cells separated by a black dot contain digits with a ratio of 1:2.  Not all possible dots are given.  Each purple line cannot contain a repeated digit; nor can it contain ANY consecutive digits.  eg if a line has a 3 anywhere on it then neither 2 nor 4 can appear on that line."}
,{"id":"fq3F2mrp4R","rules":"Normal sudoku rules apply."}
,{"id":"ftPDHg3r3Q","rules":"In all three grids, 1-6 must appear in each row, column and marked region. In grid 2, digits must increase along thermometers from the bulb end. In grid 3, digits in cages cannot repeat and must sum to the total given. Blue cells contain the same digit in the same order in grids 1 and 2. Orange cells contain the same digit in the same order in grids 2 and 3."}
,{"id":"g8JDR3TR6p","rules":"Normal sudoku rules apply. Some cages show their sums. Clues outside the grid show the sum of indicated diagonals, which may include repeat digits."}
,{"id":"gF94jrq8bf","rules":"Divide the grid into regions, such that no two regions of the same size touch orthogonally.  Each cell contains a digit that indicates the size of the polyomino it is in.  Clues outside the grid indicate the distance to the first seen highest digit in the corresponding row/column.  So, starting from a clue X, the Xth cell from that direction is the first appearance of the highest value in the row/column. Eg the 2 in row 2 means that r2c8 contains the highest digit in that row (although r2c1 to r2c7 may or may not have the same value.)"}
,{"id":"gFgtmMjPRm","rules":"Normal sudoku rules apply, and identical digits cannot be within a king's move of each other. Digits do not repeat on the blue diagonals. Cages show their sums. Digits along an arrow sum to the number in the circle."}
,{"id":"gJNMrP2P4Q","rules":"1-6 appear in each, row and region. Along thermometers, digits increase from the bulb."}
,{"id":"gJPqRPQjrF","rules":"Normal Sudoku rules apply. Digits on arrows must sum to the digit in that arrow's circle. Digits may repeat on arrows if allowed by other rules."}
,{"id":"gN79Qm9HfT","rules":"Normal sudoku rules apply. Digits may not repeat in cages or on the ampersand (which therefore forms an additional region). All cages contain digits summing to the same total, which is to be determined. Letters represent the digits 1-9 in alphabetical order (so A=1, E=2, ..., R = 9). Cells separated by a white dot contain consecutive digits. Not all possible dots are given. "}
,{"id":"gNJB4r6GBq","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage."}
,{"id":"gTpgbhLD96","rules":"Normal sudoku rules apply. Digits read the same either way along grey palindromes. Cells joined by X sum to 10 and those joined by V sum to 5. Not all Xs and Vs are shown. Digits in the cage total 17."}
,{"id":"gdH4d4ThtQ","rules":"Normal sudoku rules apply. Digits along a thermometer must increase from the bulb end. Cells connected by an X or V must sum to ten or five, respectively. Not all Xs and Vs are shown. Clues outside the grid give the sum of the digits along the indicated diagonal. Digits may repeat along the diagonals if allowed by normal rules."}
,{"id":"gf6J42PBQ4","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage.  Each main diagonal (marked in blue) cannot contain a repeated digit."}
,{"id":"ghGLRhdjHP","rules":"Normal sudoku rules apply, and digits do not repeat on the marked diagonals or in cages. Cages sum to the number given. Inequality signs point to the lower of the two digits they link."}
,{"id":"gjQ8Fhjnbg","rules":"Normal sudoku rules apply. Digits cannot repeat on the marked diagonals. The 7 grey cells are a 'ridge' of high numbers parting the two sides of the grid, meaning each digit in a grey cell must be larger than the digits in white cells which share an edge. One of the four pairs of coloured boxes contains two 3s. None of the other coloured boxes may contain any 3s."}
,{"id":"gjdPMght6H","rules":"Normal sudoku rules apply. Digits along a purple 'renban' line must be a set of consecutive, non-repeating digits in any order.  Minimum/maximum cells must be greater than or less than their orthogonally-adjacent neighbours, as indicated by the symbols bordering the cell."}
,{"id":"gjrqn4bQHm","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb. Digits along an arrow sum to the number in the circle. Digits on the purple line are consecutive digits in any order. A white dot joins two consecutive digits; a black dot joins digits with a 1:2 ratio; an X joins two digits that sum to 10. Cages show their totals. A clue outside the grid shows the sum of the indicated diagonal. Not all markings are given."}
,{"id":"gmG2d2P9dD","rules":"Normal sudoku rules apply. Digits on a purple line form a set of consecutive, non-repeating digits in any order. Digits in circles must appear at least once in the four cells touched by the circle. Adjacent digits on a green line must have a difference of at least 5. Digits in a cage must sum to the small clue in the top left corner of the cage."}
,{"id":"gnTqBG79H8","rules":"Normal sudoku rules apply. Each marked line must contain a non-repeating set of consecutive digits, in any order."}
,{"id":"gnnGpPJt2h","rules":"Place the digits 1-9 in each row, column, and irregularly shaped region. The central cell and four dominos at the corners of the grid together comprise a single region. Inequality signs indicate which of two adjacent digits is larger."}
,{"id":"gqBHm2hJhH","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage (where given).  Digits cannot repeat within a cage."}
,{"id":"grfN7fj9gM","rules":"Normal sudoku rules apply. Digits outside the grid have to be placed in the corresponding row/column in the given order, where the second digit is placed X cells away from the first digit and X is the digit in the first cell of that row/column."}
,{"id":"gtDt2HMnBh","rules":"Normal sudoku rules apply. Digits may not repeat in cages, and cages show their totals."}
,{"id":"h3MNDhttmF","rules":"Normal sudoku rules apply. Cages show their sums. A clue outside the grid shows the sum of the indicated diagonal, which can include repeat digits. All lines in the grid are thermos, with bulbs to be determined, which increase from one end of the line to the other."}
,{"id":"h92bTBgj9h","rules":"Normal sudoku rules apply. Clues outside the grid indicate the maximum sum of a group of connected ascending digits from that side in that row/column."}
,{"id":"h92qrddJMN","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage."}
,{"id":"hBgtTT8R8L","rules":"1-9 appear in each row, column and marked region."}
,{"id":"hDGn826PjG","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits cannot repeat within a cage."}
,{"id":"hHRtRmf448","rules":"Place the digits 1 to 6 exactly once into every row, column and region.  The regions need to be determined and each is a set of six connected cells. Two orthogonally adjacent cells belong to different regions if and only if their digits add up to 7. Digits increase along a thermometer starting from the bulb end."}
,{"id":"hJ3qL9nN4Q","rules":"Place the digits 0-9 in the grid so that every row, column and 3x3 box contains every digit exactly once. To enable this, there is a single Schrdinger cell in each box, containing a superposition of two different digits. Every Schrdinger cell contains a unique pair of digits. No Schrdinger cell can see another Schrdinger cell by a Queen's move in chess (i.e. any distance horizontally, vertically or diagonally). Digits in a cage may not repeat and must sum to the indicated total. Schrdinger cells contribute the average of their two digits to the cage total."}
,{"id":"hJmD6F2dgT","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the attached circle."}
,{"id":"hL28FggBj3","rules":"Normal sudoku rules apply. Digits cannot repeat in cages, which show their sum. Numbers along an arrow sum to the number in the circle. X joins two cells which sum to 10; not all X's may be given."}
,{"id":"hLFhRQp4gd","rules":"Normal sudoku rules apply. White dots separate two consecutive numbers. Black dots separate two numbers with a ratio of 1:2. Not all dots are given. Numbers outside the grid (which must be deduced) indicate the sum of the x first digits in that row or column seen from the direction of the clue, where x is the first of those digits."}
,{"id":"hM8rMMdbrN","rules":"Place the digits 1-9 in each row, column, and irregularly shaped region. The central cell and four dominos at the corners of the grid together comprise a single region. Inequality signs indicate which of two adjacent digits is larger."}
,{"id":"hN4mD6bGgp","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat along such a diagonal (if allowed by other rules)."}
,{"id":"hTHqF2DP3b","rules":"Normal sudoku rules apply.   In the finished grid, every cell will be part of a group of orthogonally connected cells that share the same parity (ie an odd or even group).  Such a parity group can be as small as a single cell, or large enough to span multiple boxes and include repeating digits.  Corner clues give the sum of all cells in the parity group containing that cell.  Black dots separate cells with a 1:2 ratio.  Not all possible black dots are given."}
,{"id":"hd6HrLnqQ3","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the attached circle. The clue outside the grid gives the sum of the indicated diagonal. Digits may repeat on arrows or diagonals."}
,{"id":"hdDrHHQM6B","rules":"Normal sudoku rules apply. Around a white dot digits ascend clockwise from a point to be determined. Around a black dot digits similarly ascend anti-clockwise."}
,{"id":"hdmtBhD6jQ","rules":"Normal sudoku rules apply.  Along thermometers, digits must increase from the bulb end. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage.  Digits along an arrow must sum to the digit in that arrow's circle/pill.  The two digit pill total is read from top down.  Digits in cells separated by X must sum to 10.  Not all Xs are given."}
,{"id":"hfFNPbgfND","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue given in the top left corner of the cage.  Digits cannot repeat within a cage. Along thermometers, digits must increase from the bulb end."}
,{"id":"hfLNJ9tghB","rules":"Normal sudoku rules apply. Each of the main diagonals contain the digits 1 to 9. Each of the clues along the outside are little killer clues (ie they are the sum of the digits along a diagonal, where digits may repeat along the indicated diagonal). You must determine the direction that each little killer arrow points in."}
,{"id":"hmDNFhhrdL","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage. Each grey line contains a set of consecutive, non-repeating digits, in any order."}
,{"id":"hnmfqnpt2P","rules":"Normal sudoku rules apply. White dots separate two consecutive numbers. Black dots separate two numbers with a ratio of 1:2. Not all dots are given. Numbers outside the grid (which must be deduced) indicate the sum of the x first digits in that row or column seen from the direction of the clue, where x is the first of those digits."}
,{"id":"hnrnDL7Q8L","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage. Find an orthogonally connected path that starts and ends in the green cells. Digits on the path that are inside killer cages must be low (4 or lower); cells on the path that are outside of killer cages must be high (6 or higher). The path does not touch itself orthogonally or diagonally."}
,{"id":"hpm9Th9mDq","rules":"Place the digits 1-9 in each row, column, and irregularly shaped region. Cells that are a chess knight's move apart cannot contain the same digit. No two orthogonally adjacent cells can contain consecutive digits."}
,{"id":"hrHdD39Pqr","rules":"Normal sudoku rules apply. Digits increase along thermos from the bulb. Clues outside the grid sum the indicated diagonal, which may include repeats. Cages' sums are given."}
,{"id":"j2q9fNRTDf","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage. Along thermometers, digits must increase from the bulb end."}
,{"id":"j3R2Nm447j","rules":"Normal sudoku rules apply. Digits along the main diagonals can not repeat. Neighbouring numbers along green lines must differ by at least 5. Numbers in circles must appear in the surrounding 2x2 cell area."}
,{"id":"j3RRHDn7M9","rules":"Normal sudoku rules apply. Three of the four digits touching a circle sum to the fourth digit.  Not all circles are necessarily given."}
,{"id":"j3gbPrGt2h","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the circle. CLues outside the grid sum the indicated diagonal, which may include repeats. Grey lines are palindromes, reading the same forwards and backwards."}
,{"id":"j42NrmtQhP","rules":"Normal sudoku rules apply. Digits in a green cell and the next green cell in the same column or row must sum to a digit in one of the cells between them."}
,{"id":"j4t8fTBL3F","rules":"Each colour represents a number from 1-9. Each box has its number placed on the grid. If that number's colour is in that box, then only the colour is shown. The grey circle represents a 9th colour."}
,{"id":"j7H9pphNm7","rules":"Normal sudoku rules apply. Along a thermometer, digits increase from the bulb end. Digits on a purple line are strictly between the digits in the circled ends. Digits in a cage sum to the small clue in the top left corner of the cage. Cells with a grey square must contain even digits."}
,{"id":"j7qqn66P3L","rules":"Normal Sudoku rules apply. Each marked circle must contain a sequence of consecutive digits. The starting point and direction are unknown."}
,{"id":"j87R9nmNNP","rules":"Each row, column and white or grey 3x3 box contains each digit 1 to 9 exactly once. Place a wall between all orthogonally adjacent cells that contain consecutive digits. Some walls are already given and they also separate two consecutive digits. A circled digit indicates how many cells it can see in a horizontal and vertical direction including its own cell.  Walls obstruct the view. Not necessarily all circles are given."}
,{"id":"j8DQN3mPG3","rules":"Normal sudoku rules apply. Along thermometers, digits increase from the bulb end. Each purple line must contain a set of non-repeating consecutive digits, which can appear in any order. "}
,{"id":"jDNqJNjtdG","rules":"Normal sudoku rules apply. A digit in a cell with a circle is the same as the number of the surrounding cells (not counting the cell itself) with odd numbers.  (So a total of 8 possible surrounding cells).  All possible circles are given."}
,{"id":"jGj4Gf36nb","rules":"Normal sudoku rules apply, and shading cells will help you solve the puzzle! Clues outside the grid show the sums of digits in shaded cells. The groups of shaded cells must be separated by at least 1 unshaded cell. In addition - one of the following rules applies: Rhino rule (cells that are n cells over and n+1 cells up cannot have the same digit for each value of n); Camel rule: identical cells cannot be an extended knight's move apart (a regular knight's move is 1:2 , a camel move is 1:3; Elephant rule (cells 1 or 2 steps diagonally apart cannot have an identical digit)."}
,{"id":"jJRTHJfDQG","rules":"Normal sudoku rules apply. Digits along an arrow sum to the digit in that arrow's circle. Adjacent digits on a green line must differ by at least 5. Cells separated by a black dot must contain digits in a 1:2 ratio. Cells separated by a white dot must contain consecutive digits.  Not all possible dots are necessarily given."}
,{"id":"jNj6NhQJQ2","rules":"Normal sudoku rules apply. Digits along thermometers must increase from bulb to tip."}
,{"id":"jQQf2DBMLT","rules":"Normal sudoku rules apply. Digits cannot repeat in cages or along the main (marked) diagonals. Each cell in the grid must be shaded dark or light according to the following rules: 1) within cages, the dark cells will sum to the cage's total (if given); 2) dark cells may not be orthogonally adjacent to one another;  3) all the light cells must be orthogonally connected in a single group; 4) a straight (orthogonal) line of light cells cannot span across more than two cages; and 5) the dark cells along the two main diagonals must sum to the same total."}
,{"id":"jQdTf2Rtp2","rules":"Normal sudoku rules apply.  Digits along an arrow must sum to the digit in that arrow's circle.  In cages, digits must sum to the small clue in the top left corner of the cage.  Each main diagonal (marked in blue) cannot contain a repeated digit."}
,{"id":"jbhNgft4jG","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within cages.  Digits along arrows must sum to the digit in that arrow's circle."}
,{"id":"jfNRTfqrgg","rules":"Normal sudoku rules apply. Digits do not repeat in cages, which show their sums. Digits along arrows sum to the digit in the attached circle, and may include repeats. Digits cannot repeat on the marked diagonal. Digits increase from the bulb on thermos."}
,{"id":"jgp8jqr7qm","rules":"Normal sudoku rules apply. Neighbouring digits on a green line have a difference of at least 5. Digits on a grey line must be between the digits in the attached circles. Black dots join digits with a 1:2 ratio. Not all dots are given."}
,{"id":"jjb2D9jnLf","rules":"Normal sudoku rules apply. For the red cells, the sum of their orthogonal neighbours (which can include repeats) equals the sum of the clue in the cell and its correct digit."}
,{"id":"jjmjLT7GqH","rules":"Normal sudoku rules apply. All regions of the same colour must include the same digits in the same order. "}
,{"id":"jnb34B883R","rules":"Normal sudoku rules apply. Digits cannot repeat within a cage. All marked cages have a different sum."}
,{"id":"jq7Mq6qFTN","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Each main diagonal (marked in blue) cannot contain a repeated digit. Cells separated by a white dot must contain consecutive digits.  Not all possible white dots are given."}
,{"id":"jqQHm9B29j","rules":"Contained within the grid are nine non-overlapping 3x3 square regions, which must be located. Each region contains the digits 1 to 9 once each such that no digit repeats in any row or column of the grid. Cells outside regions do not contain digits.  The digits in each cage sum to the clue in the top left corner, and may not repeat. Cages may include cells outside regions."}
,{"id":"jrB7Q9FQqh","rules":"Normal sudoku rules apply.  The digits in a cage sum to the number in the upper left corner. Neighbouring digits along a line have a difference of at least 5."}
,{"id":"jrdBR9H43F","rules":"Normal sudoku rules apply.  Digits along lines must appear exactly twice along the line.  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage."}
,{"id":"m23L8jF87m","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Shade some cells so that all shaded cells form one orthogonally connected area. Arrow circles are the clues for a Canal View puzzle. Ie They cannot be shaded, and represent the number of shaded cells connected in a straight line horizontally or vertically to the clue. No 2x2 region may be entirely shaded. Additionally, digits cannot repeat within unshaded regions."}
,{"id":"m2F9RPPr6R","rules":"Normal sudoku rules apply. Cages show their sums. Orthogonally neighbouring cells cannot contain consecutive digits."}
,{"id":"m2TTpBPtg2","rules":"Normal Sudoku rules apply.  External clues show the digit which repeats most along the pointed diagonal. No other digit may repeat equally as much."}
,{"id":"m67L3GdtdG","rules":"Normal sudoku rules apply. Cells separated by an X must contain digits summing to 10.  Cells separated by a white dot must contain consecutive digits.  Cells separated by a black dot must contain digits with a 1:2 ratio.  Not all dots or Xs are given."}
,{"id":"m6JLP2B72M","rules":"Normal sudoku rules apply. Circled numbers must appear in at least one of the four cells touching that circle. Small circles (without a number in them) link cells containing consecutive digits."}
,{"id":"m7mqTjNQb4","rules":"Normal sudoku rules apply. The digits in white circles must appear in one of the four cells touching the circle.  The digit in the grey cell must be higher than its four orthogonal neighbours.  Additionally every edge of the cube sums to the same two-digit number and this number is given in the grid by the 3 two-cell cages (all of which are filled identically), with the tens digit as the top number and the units digit below that."}
,{"id":"m9P9N9DLFh","rules":"Normal sudoku rules apply. Each purple line must contain a set of non-repeating consecutive digits in any order. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"mFrFt2R4gr","rules":"Normal sudoku rules apply.  Each 3x3 box contains 4 ovals.  Exactly one oval is correct ie every digit in the oval must appear somewhere in the surrounding four cells.  The other three ovals are incorrect ie no digit from an incorrect oval can appear in any of the four cells surrounding that oval. "}
,{"id":"mTPrqGJ6pJ","rules":"Normal sudoku rules apply: 1-9 appear in each row, column and 3x3 box."}
,{"id":"mbFRbGfbMH","rules":"Normal sudoku rules apply.  In cages digits must sum to the small clue in the top left corner of the cage. Clues outside the grid give the sum of the digits sandwiched between the 1 and 9 in that row/column."}
,{"id":"mdtTb9qmhp","rules":"Normal sudoku rules apply"}
,{"id":"mgrb2BqHqr","rules":"Normal sudoku rules apply. Numbers along an arrow must sum to the number in the arrow's circle. Two of the orange dots are thermometer bulbs and the third is the beginning of a palindrome. Which dot is which is to be determined. The palindrome is 10 digits long and goes around one of the heart shapes. Numbers increase from the bulbs of the thermometers on both sides of the heart shapes to the common end point at the base of the heart (r5c3 and/or r9c3 and/or r7c7)."}
,{"id":"mhHB7J4P4p","rules":"Normal sudoku rules apply.  Digits along an arrow sum to the digit in that arrow's circle. Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits can repeat along such a diagonal if allowed by other rules. Digits cannot repeat within a cage.  The digits in each cage, when added together, sum to the same total for each cage. "}
,{"id":"mnPH4dRJMB","rules":"Normal sudoku rules apply. Each of the given equations must be satisfied, reading left-to-right or downwards. Addition (+), subtraction (-), multiplication (x), division (/) and powers (^) may be used, so that 3^2=9 for instance."}
,{"id":"mnPm37QtDd","rules":"Normal sudoku rules apply. Cells separated by a knight's move (in chess) cannot contain the same digit. Digits in each cage sum to the same total, which must be deduced. Cells separated by an orange dot contain digits that are either consecutive or in a 1:2 ratio (or both)."}
,{"id":"mqBfrp8gGh","rules":"Normal sudoku rules apply. Circles represent one end of a 'Between Line'. Circle digits give the length of the rest of the line including line cells and the other endpoint (eg 3 = 2 line cells + the other endpoint cell). Other endpoints are not circled digits. Line digits must have a value between the two endpoint digits. Lines may only move orthogonally, cannot cross or share endpoints. All Between Lines have at least one line cell. Endpoints of the same Between Line may not be in orthogonally adjacent cells."}
,{"id":"mt2NhLT7g3","rules":"Normal sudoku rules apply. Digits in the grid represent skyscrapers of their height, and a clue outside the grid shows how many can be seen in that row/column from that vantage point."}
,{"id":"mt7pgJhd9q","rules":"Totally normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits must not repeat in a cage. There is exactly one cage in the grid where the cage is broken ie either the sum is incorrect or digits are repeated or both.  The pink lines are 'incomplete arrows'.  The digit on one end of the line is the sum of the other digits on the same line."}
,{"id":"n3MFRmd3Fb","rules":"Norrmal sudoku rules apply. An arrow indicates that 9 appears in that number of cells in that direction (for instance, a 1 in an arrow cell indicates that 9 appears in the adjacent cell in that direction."}
,{"id":"n4LPm2h3fD","rules":"Normal sudoku rules apply. For each line, digits on that line have an equal sum within each box the line passes through. Cells separated by a white dot contain consecutive digits. Cells separated by a black dot contain digits in a 1:2 ratio."}
,{"id":"n4mjFQQjbT","rules":"Normal sudoku rules apply."}
,{"id":"n6tP7pMpNf","rules":"Normal sudoku rules apply. The digits on each line sum to the sum of the digits in the circles on the line's ends.  Eg If two circles containing 7 and 9 are connected by a line of length 3, that line might contain the digits 6, 3 and 7.  Digits can repeat along a line and its circles if allowed by other rules.  "}
,{"id":"n7PPHLg8pT","rules":"Normal sudoku rules apply. Digits do not repeat in cages. Adajcent cages share at least one edge. If adjacent cages have sums that are consecutive, there is a white dot between the cages. If adjacent cages have sums that are in a 1:2 ratio, there is a black dot between the cages."}
,{"id":"nB66jBP6JG","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle. Cells separated by a knight's move (in chess) cannot contain the same digit."}
,{"id":"nFHGGRm34m","rules":"Riddle: On a dark, moonless night, four friends are escaping a horde of 30 zombies. They come to an old rickety bridge. At most two can cross the bridge at a time and they must use a flashlight to see. They only have one flashlight, so someone must bring it back each time until everyone is across. Shaun takes 1 minute to cross, Liz takes 3, Ed takes 7 and Dianne takes 9. The zombies will get to the bridge in 20 minutes. How can everyone get across before the zombies arrive? Sudoku: Normal sudoku rules apply. Digits along an arrow sum to the digit in that arrow's circle. Digits on indicated diagonals sum to the pointing value. Rows 1,3,5,7,9 represent bridge crossings in order. The friends have to get from the left bank to the right. Place them on the bridge (ie the arrow) and the banks on either side. People are represented by their crossing time. The sandwich clues to the right indicate the total time after each crossing. A sandwich clue gives the sum of digits 'sandwiched' between the 1 and 9 in their row."}
,{"id":"nGtnmLtndn","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. The cages themselves must be deduced.  Each cage is a snake path of orthogonally connected cells that starts or ends at the cage sum cell.  Each cage is a minimum of 2 cells long.  Note the snake line must not branch; must always have the small cage total clue in its top left corner (topmost prioritised over leftmost); and your snake MAY touch itself.  Adjacent digits along each snake path must have a difference of at least 5. Cages may not overlap."}
,{"id":"nPjp4Mr47P","rules":"Normal sudoku rules apply. Numbers outside the grid must appear in the first three cells from that direction. Numbers in grey cells must be larger than numbers in any (orthogonally) neighbouring white cells."}
,{"id":"nQHjr7Ggpg","rules":"Normal sudoku rules apply. Clues outside the grid show the sum of the indicated diagonal, which may include repeat digits."}
,{"id":"nT2mRJ3BMb","rules":"Normal sudoku rules apply. Digits cannot repeat within a cage and must sum to the digit in the top left corner if given. Digits along an arrow must sum to the digit in that arrow's circle. Digits cannot repeat along either of the diagonals."}
,{"id":"nbb8rJ69Ht","rules":"Normal sudoku rules apply. Shade some cells in the grid such that clues outside the grid show the sums of consecutive runs of shaded cells in that row/column (each run separated by at least one unshaded cell).  On each blue line, digits must be consecutive and cannot repeat (but can appear in any order).  "}
,{"id":"ndM7Hr7PQm","rules":"Normal sudoku rules apply. Each arrow needs to be extended by one cell that is a king's move from its current tip.  Arrows cannot share their last missing cell.  The last cell cannot be on any of the given circles or on any of the given arrow cells.  The digit in an arrow's circle is the sum of all the digits along the arrow, including the digit on that arrow's missing arrow tip."}
,{"id":"ngJ7MLBQLd","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits cannot repeat within a cage. Cells separated by a white dot must contain consecutive digits. Not all possible dots are given."}
,{"id":"nnDBmprdLN","rules":"Digits may not repeat in cages. Digits may not repeat along main diagonals. Digits along the arrow sum to the number in the pill, read left-to-right. Digits that share a white dot are consecutive. Digits that share a black dot are in a 1:2 ratio. Not all dots are given."}
,{"id":"nnrFQqJD3D","rules":"Normal sudoku rules apply. Identical digits cannot be a knight's move apart."}
,{"id":"nqRP3L4PbD","rules":"Normal sudoku rules apply. The product of digits on each line is 2520."}
,{"id":"p3MJ76pJ29","rules":"Normal sudoku rules apply. The marked diagonal contains no repeated digits. The grey lines are palindromes, reading the same each way. Clues outside the grid mark diagonals, which sum to a 2-digit number given by the first two digits in the direction of the arrow."}
,{"id":"p3Nm96MDBp","rules":"Normal sudoku rules apply. All lines in the grid are 'renban' ie they must each contain a set of consecutive, non-repeating digits in any order. Cells containing an opaque grey square must contain an even digit.  Digits in circles must appear in at least one of the cells touched by the circle."}
,{"id":"p7RR7MBh9h","rules":"Normal sudoku rules apply. Digits along a thermo increase from the bulb. Digits along an arrow sum to the number in the circle. Neighbouring digits on a green line must have a difference of at least 5."}
,{"id":"p89L9JTQB8","rules":"Normal sudoku rules apply. Digits on a line must be between the digits in the connected circles, i.e. greater than the lower of the two circled digits and lower than the greater of the two circled digits. Digits connected by a black dot must have a ratio of 2:1. Not all possible dots are given."}
,{"id":"p9ttmLjQ4T","rules":"Normal sudoku rules apply. Draw a path along the grey lines from the lower-left to the top-right that goes through all  cells.  cells indicate that the digits before and after them along the path have a 1:2 ratio. Red squares must be coloured depending on their odd/even parity. The path must separate the red cells such that all red cells in each region are the same colour.  It is NOT REQUIRED that red cells in adjacent regions be of different colour."}
,{"id":"pGPJQ3B84P","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage. Digits cannot repeat within a cage. There are exactly five enemy ships.  A ship is a straight-line of orthogonally-connected cells; two ships are 3 cells long; and the remaining ships are of lengths 2, 4 & 5 cells.  Cells in the given cages (green) are land.  All other cells (blue) are sea.  Ships can only occupy sea cells.  Ships cannot touch each other, even diagonally.  Each ship acts like a cage with a sum of 15.  Ships are unambiguous and the negative constraint applies.  In other words, any line of 2/3/4/5 sea cells which sum to 15 MUST be a ship. Similarly any line of sea cells which cannot be a ship CANNOT sum to 15."}
,{"id":"pT24tfPFL8","rules":"Normal sudoku rules apply. Adjacent digits on a grey line must differ by at least 5. The digits in two orthogonally adjacent cells must not add up to 5 or 10."}
,{"id":"pgMTGbtm22","rules":"Normal sudoku rules apply. Along a thermometer, digits must increase from the bulb."}
,{"id":"ptrTq8MMmt","rules":"Normal sudoku rules apply.  Digits cannot repeat within a cage. Cages with the same size must have the same sum and cages with different sizes must have different sums."}
,{"id":"q3jhj7DBGn","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage. Digits cannot repeat within a cage.  Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"q7FMdJ4QD9","rules":"Normal sudoku rules apply. Digits do not repeat in cages, and cages all sum to the same number, to be determined by the solver."}
,{"id":"q7g3F93T6h","rules":"Normal sudoku rules apply. Along thermometers, digits must increase from the bulb end."}
,{"id":"q8R69ndLt4","rules":"Normal sudoku rules apply. Draw a circle in one of the cells of each line.  The digit in the circle gives the sum of the digits towards (each of) the remaining end(s) of the line."}
,{"id":"q9BrpGqTQM","rules":"Normal sudoku rules apply. Clues outside the grid give ALL digits that are adjacent to the 9 in that row/column."}
,{"id":"qB2PLPbq63","rules":"Normal sudoku rules apply. Grey lines are palindromes, reading the same each way."}
,{"id":"qD6FFRP88b","rules":"Normal sudoku rules apply. Numbers in the grid represent the heights of skyscrapers. Clues outside the grid indicate the number of visible skyscrapers in that row/column as seen from that vantage point. Different colours represent different numbers consistently."}
,{"id":"qF8D7mDRnF","rules":"Normal sudoku rules apply.  Along thermometers, digits must increase from the bulb end.  The thermometers in this puzzle are all hidden, only their bulbs or their tips are given.  Corresponding tips and bulbs share the same colour.  For two thermometers only the tip is given (in grey and black).  All thermometers must be at least two cells long.  Thermometers cannot cross and different thermometers cannot share a cell."}
,{"id":"qFrmgJ98Nh","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Digits along arrows sum to the digit in that arrow's circle. Cells separated by a white dot must contain consecutive digits.  Not all possible dots are given."}
,{"id":"qH42fp9hLh","rules":"Normal sudoku rules apply. Every cage in the grid will add up to the same total (to be determined), unless acted upon by a yellow cell. The yellow cells within or attached to killer cages indicate the amount the cage total is off by (eg if the total is 25 and the yellow cell is 5, then the real total is either 20 or 30). Digits in a cage will then add up to the new total, without repeats.  The black dots only help show which cages the yellow cells are attached to - they are not ratios. The yellow cell in r9c6 applies to the cage it is connected to, and possibly also its own cage."}
,{"id":"qJH7jPp2p9","rules":"Normal sudoku rules apply. Digits on thermometers increase from the bulb to the end. Digits on arrows sum to the number in the attached circle. The central cell must be less than its orthogonally adjacent neighbors. The greater than symbols point' to the smaller cell."}
,{"id":"qLJgbhGhFb","rules":"Normal sudoku rules apply. The digit in a circled cell represents the total count of shaded cells in connected groups sharing an edge with that digit.  Cells with circles cannot be shaded.  Each digit in a shaded cell must be larger than any digit in an adjacent unshaded cell."}
,{"id":"qLggJDjpgm","rules":"Normal sudoku rules apply. Digits along thermometers must increase from the bulb. Digits in cages sum to the given total. Digits along the indicated diagonal must sum to the given total and may repeat. Green cells are Sujiken (no digit is repeated in any diagonal in any direction in this area)."}
,{"id":"qMRg43pfRn","rules":"Normal sudoku rules apply. Digits on an arrow must repeat at least once in the direction of the arrow."}
,{"id":"qN79DqMtBT","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage.  Cells along an arrow must strictly increase towards the circle and must sum to the digit in the circle."}
,{"id":"qR6b8L3htF","rules":"Normal sudoku rules apply."}
,{"id":"qT84jPJ8b2","rules":"Normal sudoku rules apply. No two orthogonal neighbours can sum to 4 or a multiple of 4. Any line in the grid has a sequence of consecutive digits, not in any particular order."}
,{"id":"qTdnQ2MjL8","rules":"Normal sudoku rules apply. Cages show their sums. Along thermometers, digits ascend from the bulb."}
,{"id":"qdJpNj4rQ9","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage. Adjacent digits in the green ring are never more than 4 apart. Adjacent digits in the blue ring are a multiple/factor of each other."}
,{"id":"qfF8MpQ6Dm","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage (if given).  Digits cannot repeat within a cage.  Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits can repeat along such a diagonal if allowed by other rules."}
,{"id":"qgnrth64HH","rules":"Normal sudoku rules apply. In cages, digits must sum to the small clue in the top left corner of the cage.  Cells separated by a knight's move (in chess) cannot contain the same digit."}
,{"id":"qgr8DdGPn7","rules":"Normal sudoku rules apply. Digits do not repeat in cages, which show their sums. The grey cell in row 2 column 8 marks an even digit."}
,{"id":"qh9JfG47bJ","rules":"Normal sudoku rules apply. There are white circles in the grid that contain a number and a maths operation. When that operation is applied to each of the diagonally opposite pairs of digits surrounding the circle, the result is always equal to the number in the circle. "}
,{"id":"qhRdqQDTq9","rules":"Normal sudoku rules apply. Digits cannot repeat along marked diagonals."}
,{"id":"qjQqPpPPQ7","rules":"Normal sudoku rules apply. Each main diagonal (marked in blue) cannot contain a repeated digit. Digits along an arrow must sum to the digit in that arrow's circle. Adjacent digits on green lines must differ by at least 5."}
,{"id":"r3qFHRhTbh","rules":"Normal sudoku rules apply. Cells separated by a black dot contain digits in the ratio of 1:2. Cells separated by a white dot contain consecutive digits. Cells separated by an X contain digits summing to 10.  Cells separated by a V contain digits summing to 5.  Not all possible dots or X/V clues are necessarily given."}
,{"id":"r4QbD3Bb6F","rules":"Normal sudoku rules apply. A single, orthogonally connected region must be shaded. Circles are not shaded - digits in circles show the number of surrounding cells that are shaded. Squares are shaded; the digit in a square is the number of shaded cells that cell 'sees' (up/down/left/right), including itself, until reaching an unshaded cell."}
,{"id":"r84n6GgQfd","rules":"Normal sudoku rules apply. Digits in arrow cells tell you how far it is to the digit 9 in that direction. For example, if the digit 2 appears in r1c3, then a 9 must appear two cells to its right, in r1c5."}
,{"id":"r9rLrppHpT","rules":"Normal sudoku rules apply. Numbers in circles show the difference between the adjoining pair of digits. Digits separated by a V sum to 5. Digits separated by an X sum to 10. Not all such differences, Xs or Vs are shown."}
,{"id":"rDpM7bngfd","rules":"Normal sudoku rules apply. Digits outside the grid show the sum to the digits sandwiched between the 1 and the 9 in their row/column. Digits in circles must appear at least once in the four cells surrounding that circle.  "}
,{"id":"rGF3gpgnmM","rules":"Normal sudoku rules apply. Digits on a line must fall 'outside' the range of their yellow endpoints (eg endpoints of 1 and 8 only allow 9 on the line connecting them.) Each endpoint value must differ by at least 4 from other directly connected endpoints. Digits on a line may repeat if allowed by other rules."}
,{"id":"rHF7grr29B","rules":"Normal sudoku rules apply. Circles mark odd digits; squares mark even digits."}
,{"id":"rJDLMnH7LB","rules":"Normal sudoku rules apply."}
,{"id":"rJHqfTTLDj","rules":"Normal sudoku rules apply.  Along thermometers, digits must increase from the bulb end.  The thermometers in this puzzle are all hidden, only their bulbs or their tips are given.  Corresponding tips (lower-case) and bulbs (upper-case) share the same letter.  For two thermometers only the tip is given (in g and h).  All thermometers must be at least two cells long.  Thermometers cannot cross and different thermometers cannot share a cell."}
,{"id":"rMrRr4t7j4","rules":"Normal sudoku rules apply. Each grey and red line contains a set of consecutive, non-repeating digits, in any order.  Clues outside the grid give the sum of the digits along the indicated diagonal.  Digits may repeat along such a diagonal (if allowed by the other rules)."}
,{"id":"rNFffthDhj","rules":"1-6 must appear in each row, column and box. Digits along an arrow sum to the number in the circle. If two cells in any two grids have the same letter written in them, those cells must contain the same digit."}
,{"id":"rPTbfNrPRH","rules":"Normal sudoku rules apply. White dots join consecutive digits. Black dots join digits with a ratio of 1:2. X's join digits summing to 10. Not all dots and X's are given. Cages show their sums. Numbers in white circles show the amount of even numbers in the surrounding four cells. All odd numbers must form an othogonally connected region at the end."}
,{"id":"rPbrd838pr","rules":"Normal sudoku rules apply. Digits along an arrow sum to the digit in that arrow's circle. In cages, digits sum to the small clue in the top left corner of the cage. "}
,{"id":"rQb8nLLN3F","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage."}
,{"id":"rRmm2D6LfN","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"rRqpfMmFbJ","rules":"Normal sudoku rules apply. Black dots join cells with a ratio of 1:2; white dots join cells with consecutive digits. A 1/2 pair could have a black or white dot. Not all possible dots are given."}
,{"id":"rT3Fj8btmP","rules":"Normal sudoku rules apply. Digits in cages must sum to the number at the top-left of the cage. Digits may not repeat within cages. Each marked diagonal contains no repeated digits. The digit in the center of the grid follows anti-queen rules: no two instances of that digit may be a chess queen's move apart."}
,{"id":"rTD6GNDFqN","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the attached circle, or pill. Digits marked in circles must appear in the surrounding four cells."}
,{"id":"rd77HGPmBP","rules":"Normal sudoku rules apply. Digits next to each other on a green line must have a difference of at least 5. An orange line contains a consecutive sequence of digits, with no repeats, not necessarily in order. Digits cannot repeat in cages, which contain their sums. The white dot joins two consecutive numbers."}
,{"id":"rf8N7NJRp3","rules":"Divide the grid into pentominoes (five-cell regions) so that no two pentominoes of the same shape (including rotations/reflections) share an edge. "}
,{"id":"rfj7QRQMRG","rules":"Normal sudoku rules apply. Cages show their sums, and digits cannot repeat within a cage. On thermometers, digits increase from the bulb. But one of the digits from 1-9 is a ghost, and is not bound by those constraints. The ghost digit still follows normal sudoku rules (appearing once in each row/column/box), but does not count toward cage sums, can repeat within a cage, and can appear anywhere on a thermometer (other digits on the thermometer must still increase from bulb to tip; the ghost digit is simply ignored)."}
,{"id":"rg6ptPrtBF","rules":"Normal sudoku rules apply. A clue outside the grid shows the sum of the indicated diagonal, which may include repeats. Each digit (1-9) has a 'buddy' that appears in all of the cells where the row and column indices are swapped. For example, if 1's are buddies with 4's and there is a 1 in r5c2, then there must be a 4 in r2c5. A number may be its own buddy. Figuring out the buddies is part of the puzzle."}
,{"id":"rpb2M36q2H","rules":"Normal sudoku rules apply. Digits in cages must sum to the number in the top left corner of the cage. Digits can not repeat within a cage.  Digits in circles must appear at least once in the four cells touching that circle."}
,{"id":"rpd3h3nrp2","rules":"Normal sudoku rules apply, and identical digits cannot be within a king's move (touching each other diagonally). Digits along arrows sum to the numbers in the circles/pills - 2-digit numbers read left-to-right or downwards."}
,{"id":"rqGH96246T","rules":"Normal sudoku rules apply. Digits along an arrow sum to the number in the attached circle. Grey circles are odd digits and grey squares are even. The X joins two cells that sum to 10."}
,{"id":"rtnR6tQR8m","rules":"Normal sudoku rules apply.  The digit on one end of each line is the sum of the 'other digits' on the same line.  Those 'other digits' are a consecutive non-repeating set in any order."}
,{"id":"t3rJTMrJHQ","rules":"Normal sudoku rules apply. Digits outside the grid give the total sum of the digits sandwiched between the 1 and the 9 in that row or column."}
,{"id":"t43n9QnBLp","rules":"Normal sudoku rules apply. Along the thermo, 2-digit numbers increase from the bulb - any 2-digit numbers beginning with 2 or 8 must have an odd second digit. The black dot joins digits with a 1:2 ratio."}
,{"id":"t7Lfmrnj4H","rules":"Normal sudoku rules apply.  Cells separated by a knight's move (in chess) cannot contain the same digit.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Digits along arrows must sum to the digit in that arrow's circle.  One of the other 8 boxes is a hidden clone of box 4.  ie the hidden clone contains the exact same digits in the exact same positions as box 4.  eg if box 8 was the clone then r4c1 and r7c4 would contain the same digit."}
,{"id":"t8PmGmHHnq","rules":"Normal sudoku rules apply. An arrow points to the next highest number. So if 8 is in an arrow cell, 9 must appear somehwere in the direction in which the arrow points."}
,{"id":"t9h6rqDj64","rules":"Normal sudoku rules apply. A river is a snake path of orthogonally connected cells starting next to a cage; the digit in that cage shows the length of the river. The number in the top-left corner of the cage shows the sum of the digits along the river. Rivers must strictly decrease in digit value, starting from next to the cage. Rivers must not include cages. Rivers may touch themselves orthogonally, and rivers may overlap."}
,{"id":"t9qDfPMm2p","rules":"Normal sudoku rules apply. Cells separated by a knight's move in chess cannot contain the same digit. Digits along an arrow must sum to the number in that arrow's circle.  Digits may repeat along arrows if allowed by other rules. Digits in cages must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage. Cells separated by a black dot must have a 1:2 ratio.  Not all possible black dots are given. Clues outside the grid give the sum of the cells along the indicated diagonal.  Digits may repeat along such a diagonal."}
,{"id":"tBfT7DHJ6F","rules":"Normal sudoku rules apply. Digits do not repeat in cages, which show their sums. The grey cell in row 2 column 8 marks an even digit."}
,{"id":"tBpR8Qn727","rules":"Normal sudoku rules apply. The low digits (1, 2, 3), middle digits (4, 5, 6), and high digits (7, 8, 9) form three different groups. Every 2x2 region within the cage must contain at least one digit from each group. Adjacent digits along orange lines must have a difference of 3 or less."}
,{"id":"tBpm7R4Mth","rules":"Normal sudoku rules apply. The cage shows its sum. Symbols on the left of cells indicate if the digit in the cell is lower (-) or higher (+) than the cell on its left. Symbols at the top of cells do the same comparing to the cell above. Clues to the left of the grid sum all cells in the row which only have - signs. Clues above the grid sum all cells in the column which only have + signs."}
,{"id":"tGHMpB9QLJ","rules":"Normal sudoku rules apply."}
,{"id":"tJ2TgrMRht","rules":"Normal sudoku rules apply. The grey line is a palindrome, reading the same forwards and backwards. There are no repeated digits in circles, nor in squares. Cages show their sums."}
,{"id":"tLRrPprg8T","rules":"Normal Sudoku rules apply. Digits may not repeat in a cage. Cage sums are all 2-digit numbers, which may be written xy, signifying that the digit at row x column y must equal n, where n is the size of the cage, e.g. if a 5-cage sums to 28 that means that R2C8 is a 5."}
,{"id":"tMBgMdtJQF","rules":"Normal sudoku rules apply. Digits along an arrow must sum to the digit in that arrow's circle."}
,{"id":"tMF4MPrFqr","rules":"Normal sudoku rules apply.  In cages, digits must sum to the small clue in the top left corner of the cage.  Digits cannot repeat within a cage.  Cells that appear in the same relative position in their 3x3 box must not contain the same digit.  eg the digit in r1c3 cannot appear in r7c6 as this would cause a repear in the North-East corner cell of the 3x3 boxes."}
,{"id":"tMHDPtqHgG","rules":"Normal sudoku rules apply. Clues outside the grid equal the Xth digit in their row/column seen from the side of the clue, with X being the 1st digit in their row/column seen from the side of the clue. "}
,{"id":"tMmgPBBP93","rules":"Normal sudoku rules apply. Given two cells which both contain the digit N, the Euclidean distance between (the centres of) those cells must be at least N times the sidelength of a single cell. In other words, if moving from one such cell to the other takes X horizontal steps and Y  vertical steps, then (X^2 + Y^2)  N. "}
,{"id":"tRpP92NMr2","rules":"Normal sudoku rules apply. Clues outside the grid show the sum of the digits between the 1 and the 9 in that row/column."}
,{"id":"tmDnmJRL7m","rules":"Normal sudoku rules apply. Some circles contain a maths operator (+,-,x,/) .  If you apply that operation to each pair of diagonal digits touching the circle then you'll get the number in the circle as the result BOTH times.  A circle with a ? instead of a number indicates that the result is the same for both pairs of digits but must be deduced.  If a circle does not contain an operator, the digit(s) in the circle must appear in at least one of the cells touching the circle."}
,{"id":"tmH7BfRPpd","rules":"Normal sudoku rules apply. Digits along arrows sum to the number in the circle, AND ascend from the arrow tip."}
,{"id":"tqq9HTQB9M","rules":"In every row, column and every bold-bordered area, each digit from 1 to 9 occurs exactly once. The digits in two orthogonally adjacent cells may not be consecutive, nor may they be in a ratio of 2:1."}
,{"id":"tt23hgFmr6","rules":"Normal sudoku rules apply. Cages cannot contain repeated digits, and their sum may be given. Clues outside the grid show sums of the indicated diagonals, in which digits can repeat. Digits along arrows sum to the number in the circle."}
,{"id":"v7oVqMfjTs","rules":"Normal Sudoku rules.\n\nSome cells have been pencilmarked with their candidates."}
]